[Killed] StringLiteral
src/audio-utils.ts:16:9
  */
 const VOICE_NAME_TO_ID: Record<string, string> = {
   Rachel: '21m00Tcm4TlvDq8ikWAM',
-  Domi: 'AZnzlk1XvdvUeBnXmlld',
+  Domi: "",
   Bella: 'EXAVITQu4vr4xnSDxMaL',
   Antoni: 'ErXwobaYiN019PkySvjV',
killedBy: audio-utils generateTTS should resolve voice name Domi to voice ID AZnzlk1XvdvUeBnXmlld
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "AZnzlk1XvdvUeBnXmlld", Any<Object>
Received: "Domi", {"model_id": "eleven_v3", "text": "Hello, world!"}

Number of calls: 1

[Killed] StringLiteral
src/audio-utils.ts:22:9
   Elli: 'MF3mGyEYCl7XYWbV9V6O',
   Josh: 'TxGEqnHWrfWFTfGW9XjX',
   Arnold: 'VR6AewLTigWG4xSOukaG',
-  Adam: 'pNInz6obpgDQGcFmaJgB',
+  Adam: "",
   Sam: 'yoZ06aMxZJJ28mfd3POQ',
   Sarah: 'EXAVITQu4vr4xnSDxMaL',
killedBy: audio-utils generateTTS should resolve voice name Adam to voice ID pNInz6obpgDQGcFmaJgB
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "pNInz6obpgDQGcFmaJgB", Any<Object>
Received: "Adam", {"model_id": "eleven_v3", "text": "Hello, world!"}

Number of calls: 1

[Killed] LogicalOperator
src/audio-utils.ts:31:10
  * Resolve voice name to ElevenLabs voice ID
  */
 function resolveVoiceId(voice: string): string {
-  return VOICE_NAME_TO_ID[voice] || voice;
+  return VOICE_NAME_TO_ID[voice] && voice;
 }
 
killedBy: audio-utils generateTTS should call ElevenLabs client with correct parameters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "21m00Tcm4TlvDq8ikWAM",
+ "Rachel",
  {"model_id": "eleven_v3", "text": "Hello, world!"},

[Killed] ArithmeticOperator
src/audio-utils.ts:66:21
   );
   // Stryker disable next-line MethodExpression: equivalent mutant - parseFloat ignores leading whitespace
   const seconds = parseFloat(stdout.trim());
-  return Math.round(seconds * 1000);
+  return Math.round(seconds / 1000);
 }
 
killedBy: audio-utils getAudioDuration should return duration in milliseconds for valid audio file
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5500
Received: 0
