[Killed] EqualityOperator
src/ffmpeg-utils.ts:24:7
   outputPath: string,
   offsetMs: number = 0
 ): Promise<string> {
-  if (segments.length === 0) {
+  if (segments.length !== 0) {
     throw new Error('No audio segments provided');
   }
killedBy: ffmpeg-utils concatAudioWithGaps should throw error when no segments provided
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: "/output/audio.wav"

[Killed] ConditionalExpression
src/ffmpeg-utils.ts:24:7
   outputPath: string,
   offsetMs: number = 0
 ): Promise<string> {
-  if (segments.length === 0) {
+  if (false) {
     throw new Error('No audio segments provided');
   }
killedBy: ffmpeg-utils concatAudioWithGaps should throw error when no segments provided
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: "/output/audio.wav"

[Killed] ArithmeticOperator
src/ffmpeg-utils.ts:29:55
   }
 
   // Sort segments by start time
-  const sortedSegments = [...segments].sort((a, b) => a.startTimeMs - b.startTimeMs);
+  const sortedSegments = [...segments].sort((a, b) => a.startTimeMs + b.startTimeMs);
 
   // eslint-disable-next-line no-console
killedBy: ffmpeg-utils concatAudioWithGaps should sort segments by start time
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "-i \"/audio/first.mp3\" -i \"/audio/second.mp3\" -i \"/audio/third.mp3\""

[Killed] MethodExpression
src/ffmpeg-utils.ts:29:26
   }
 
   // Sort segments by start time
-  const sortedSegments = [...segments].sort((a, b) => a.startTimeMs - b.startTimeMs);
+  const sortedSegments = [...segments];
 
   // eslint-disable-next-line no-console
killedBy: ffmpeg-utils concatAudioWithGaps should sort segments by start time
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "-i \"/audio/first.mp3\" -i \"/audio/second.mp3\" -i \"/audio/third.mp3\""

[Survived] MethodExpression
src/ffmpeg-utils.ts:33:21
 
   // eslint-disable-next-line no-console
   console.log(`\n[FFMPEG] concatAudioWithGaps called with ${sortedSegments.length} segments, offsetMs=${offsetMs}:`);
-  for (const seg of sortedSegments.slice(0, 10)) {
+  for (const seg of sortedSegments) {
     const adjustedTime = Math.max(0, seg.startTimeMs - offsetMs);
     // eslint-disable-next-line no-console

[Survived] BlockStatement
src/ffmpeg-utils.ts:33:50
 
   // eslint-disable-next-line no-console
   console.log(`\n[FFMPEG] concatAudioWithGaps called with ${sortedSegments.length} segments, offsetMs=${offsetMs}:`);
-  for (const seg of sortedSegments.slice(0, 10)) {
-    const adjustedTime = Math.max(0, seg.startTimeMs - offsetMs);
-    // eslint-disable-next-line no-console
-    console.log(`  [FFMPEG] segment startTimeMs=${seg.startTimeMs} -> adjusted=${adjustedTime}, path=${seg.path.split('/').pop()}`);
-  }
+  for (const seg of sortedSegments.slice(0, 10)) {}
   if (sortedSegments.length > 10) {
     // eslint-disable-next-line no-console

[Survived] MethodExpression
src/ffmpeg-utils.ts:34:26
   // eslint-disable-next-line no-console
   console.log(`\n[FFMPEG] concatAudioWithGaps called with ${sortedSegments.length} segments, offsetMs=${offsetMs}:`);
   for (const seg of sortedSegments.slice(0, 10)) {
-    const adjustedTime = Math.max(0, seg.startTimeMs - offsetMs);
+    const adjustedTime = Math.min(0, seg.startTimeMs - offsetMs);
     // eslint-disable-next-line no-console
     console.log(`  [FFMPEG] segment startTimeMs=${seg.startTimeMs} -> adjusted=${adjustedTime}, path=${seg.path.split('/').pop()}`);

[Survived] ArithmeticOperator
src/ffmpeg-utils.ts:34:38
   // eslint-disable-next-line no-console
   console.log(`\n[FFMPEG] concatAudioWithGaps called with ${sortedSegments.length} segments, offsetMs=${offsetMs}:`);
   for (const seg of sortedSegments.slice(0, 10)) {
-    const adjustedTime = Math.max(0, seg.startTimeMs - offsetMs);
+    const adjustedTime = Math.max(0, seg.startTimeMs + offsetMs);
     // eslint-disable-next-line no-console
     console.log(`  [FFMPEG] segment startTimeMs=${seg.startTimeMs} -> adjusted=${adjustedTime}, path=${seg.path.split('/').pop()}`);

[Killed] EqualityOperator
src/ffmpeg-utils.ts:38:7
     // eslint-disable-next-line no-console
     console.log(`  [FFMPEG] segment startTimeMs=${seg.startTimeMs} -> adjusted=${adjustedTime}, path=${seg.path.split('/').pop()}`);
   }
-  if (sortedSegments.length > 10) {
+  if (sortedSegments.length <= 10) {
     // eslint-disable-next-line no-console
     console.log(`  [FFMPEG] ... and ${sortedSegments.length - 10} more segments`);
killedBy: ffmpeg-utils concatAudioWithGaps should log truncated message when more than 10 segments
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "... and 5 more segments"
Received
       1: "
[FFMPEG] concatAudioWithGaps called with 15 segments, offsetMs=0:"
       2: "  [FFMPEG] segment startTimeMs=0 -> adjusted=0, path=segment-0.mp3"
       3: "  [FFMPEG] segment startTimeMs=1000 -> adjusted=1000, path=segment-1.mp3"

[Killed] BlockStatement
src/ffmpeg-utils.ts:38:35
     // eslint-disable-next-line no-console
     console.log(`  [FFMPEG] segment startTimeMs=${seg.startTimeMs} -> adjusted=${adjustedTime}, path=${seg.path.split('/').pop()}`);
   }
-  if (sortedSegments.length > 10) {
-    // eslint-disable-next-line no-console
-    console.log(`  [FFMPEG] ... and ${sortedSegments.length - 10} more segments`);
-  }
+  if (sortedSegments.length > 10) {}
 
   // Build ffmpeg filter complex for mixing audio at correct times
killedBy: ffmpeg-utils concatAudioWithGaps should log truncated message when more than 10 segments
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "... and 5 more segments"
Received
       1: "
[FFMPEG] concatAudioWithGaps called with 15 segments, offsetMs=0:"
       2: "  [FFMPEG] segment startTimeMs=0 -> adjusted=0, path=segment-0.mp3"
       3: "  [FFMPEG] segment startTimeMs=1000 -> adjusted=1000, path=segment-1.mp3"

[Killed] ArithmeticOperator
src/ffmpeg-utils.ts:40:39
   }
   if (sortedSegments.length > 10) {
     // eslint-disable-next-line no-console
-    console.log(`  [FFMPEG] ... and ${sortedSegments.length - 10} more segments`);
+    console.log(`  [FFMPEG] ... and ${sortedSegments.length + 10} more segments`);
   }
 
killedBy: ffmpeg-utils concatAudioWithGaps should log truncated message when more than 10 segments
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "... and 5 more segments"
Received
       1: "
[FFMPEG] concatAudioWithGaps called with 15 segments, offsetMs=0:"
       2: "  [FFMPEG] segment startTimeMs=0 -> adjusted=0, path=segment-0.mp3"
       3: "  [FFMPEG] segment startTimeMs=1000 -> adjusted=1000, path=segment-1.mp3"

[Killed] StringLiteral
src/ffmpeg-utils.ts:40:17
   }
   if (sortedSegments.length > 10) {
     // eslint-disable-next-line no-console
-    console.log(`  [FFMPEG] ... and ${sortedSegments.length - 10} more segments`);
+    console.log(``);
   }
 
killedBy: ffmpeg-utils concatAudioWithGaps should log truncated message when more than 10 segments
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "... and 5 more segments"
Received
       1: "
[FFMPEG] concatAudioWithGaps called with 15 segments, offsetMs=0:"
       2: "  [FFMPEG] segment startTimeMs=0 -> adjusted=0, path=segment-0.mp3"
       3: "  [FFMPEG] segment startTimeMs=1000 -> adjusted=1000, path=segment-1.mp3"

[Killed] ArrowFunction
src/ffmpeg-utils.ts:44:37
   }
 
   // Build ffmpeg filter complex for mixing audio at correct times
-  const inputs = sortedSegments.map((seg, _i) => `-i "${seg.path}"`).join(' ');
+  const inputs = sortedSegments.map(() => undefined).join(' ');
 
   const filterParts = sortedSegments.map((seg, i) => {
killedBy: ffmpeg-utils concatAudioWithGaps should build correct ffmpeg command for single segment
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "-i \"/audio/narration1.mp3\""
Received string:    "ffmpeg -y  -filter_complex \"[0]adelay=0|0,volume=1[a0];[a0]amix=inputs=1:normalize=0[out]\" -map \"[out]\" \"/output/combined.wav\""

[Killed] StringLiteral
src/ffmpeg-utils.ts:44:75
   }
 
   // Build ffmpeg filter complex for mixing audio at correct times
-  const inputs = sortedSegments.map((seg, _i) => `-i "${seg.path}"`).join(' ');
+  const inputs = sortedSegments.map((seg, _i) => `-i "${seg.path}"`).join("");
 
   const filterParts = sortedSegments.map((seg, i) => {
killedBy: ffmpeg-utils concatAudioWithGaps should sort segments by start time
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "-i \"/audio/first.mp3\" -i \"/audio/second.mp3\" -i \"/audio/third.mp3\""
Received string:    "ffmpeg -y -i \"/audio/first.mp3\"-i \"/audio/second.mp3\"-i \"/audio/third.mp3\" -filter_complex \"[0]adelay=0|0,volume=1[a0];[1]adelay=2000|2000,volume=0.5[a1];[2]adelay=5000|5000,volume=1[a2];[a0][a1][a2]amix=inputs=3:normaliz

[Killed] BlockStatement
src/ffmpeg-utils.ts:46:54
   // Build ffmpeg filter complex for mixing audio at correct times
   const inputs = sortedSegments.map((seg, _i) => `-i "${seg.path}"`).join(' ');
 
-  const filterParts = sortedSegments.map((seg, i) => {
-    // adelay takes milliseconds, delay both channels
-    // Subtract offsetMs to normalize timestamps (first event plays at t=0)
-    const adjustedTime = Math.max(0, seg.startTimeMs - offsetMs);
-    // Apply volume reduction to UI sounds, with clicks louder than keypresses
-    const volume = seg.type === 'narration' ? 1.0
-                 : seg.type === 'click' ? 0.5
-                 : 0.05;
-    return `[${i}]adelay=${adjustedTime}|${adjustedTime},volume=${volume}[a${i}]`;
-  });
+  const filterParts = sortedSegments.map((seg, i) => {});
 
   const mixInputs = sortedSegments.map((_, i) => `[a${i}]`).join('');
killedBy: ffmpeg-utils concatAudioWithGaps should build correct ffmpeg command for single segment
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "[0]adelay=0|0,volume=1[a0]"
Received string:    "ffmpeg -y -i \"/audio/narration1.mp3\" -filter_complex \";[a0]amix=inputs=1:normalize=0[out]\" -map \"[out]\" \"/output/combined.wav\""

[Killed] MethodExpression
src/ffmpeg-utils.ts:49:26
   const filterParts = sortedSegments.map((seg, i) => {
     // adelay takes milliseconds, delay both channels
     // Subtract offsetMs to normalize timestamps (first event plays at t=0)
-    const adjustedTime = Math.max(0, seg.startTimeMs - offsetMs);
+    const adjustedTime = Math.min(0, seg.startTimeMs - offsetMs);
     // Apply volume reduction to UI sounds, with clicks louder than keypresses
     const volume = seg.type === 'narration' ? 1.0
killedBy: ffmpeg-utils concatAudioWithGaps should build correct ffmpeg command for multiple segments
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "[1]adelay=2500|2500,volume=0.5[a1]"
Received string:    "ffmpeg -y -i \"/audio/narration1.mp3\" -i \"/audio/click.wav\" -i \"/audio/narration2.mp3\" -filter_complex \"[0]adelay=0|0,volume=1[a0];[1]adelay=0|0,volume=0.5[a1];[2]adelay=0|0,volume=1[a2];[a0][a1][a2]amix=inputs=3:normalize=0[out]\" -map \"[out]\" \"/output/com

[Survived] ArithmeticOperator
src/ffmpeg-utils.ts:49:38
   const filterParts = sortedSegments.map((seg, i) => {
     // adelay takes milliseconds, delay both channels
     // Subtract offsetMs to normalize timestamps (first event plays at t=0)
-    const adjustedTime = Math.max(0, seg.startTimeMs - offsetMs);
+    const adjustedTime = Math.max(0, seg.startTimeMs + offsetMs);
     // Apply volume reduction to UI sounds, with clicks louder than keypresses
     const volume = seg.type === 'narration' ? 1.0

[Killed] ConditionalExpression
src/ffmpeg-utils.ts:51:20
     // Subtract offsetMs to normalize timestamps (first event plays at t=0)
     const adjustedTime = Math.max(0, seg.startTimeMs - offsetMs);
     // Apply volume reduction to UI sounds, with clicks louder than keypresses
-    const volume = seg.type === 'narration' ? 1.0
+    const volume = true ? 1.0
                  : seg.type === 'click' ? 0.5
                  : 0.05;
killedBy: ffmpeg-utils concatAudioWithGaps should build correct ffmpeg command for multiple segments
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "[1]adelay=2500|2500,volume=0.5[a1]"

[Killed] ConditionalExpression
src/ffmpeg-utils.ts:51:20
     // Subtract offsetMs to normalize timestamps (first event plays at t=0)
     const adjustedTime = Math.max(0, seg.startTimeMs - offsetMs);
     // Apply volume reduction to UI sounds, with clicks louder than keypresses
-    const volume = seg.type === 'narration' ? 1.0
+    const volume = false ? 1.0
                  : seg.type === 'click' ? 0.5
                  : 0.05;
killedBy: ffmpeg-utils concatAudioWithGaps should build correct ffmpeg command for single segment
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "[0]adelay=0|0,volume=1[a0]"
Received string:    "ffmpeg -y -i \"/audio/narration1.mp3\" -filter_complex \"[0]adelay=0|0,volume=0.05[a0];[a0]amix=inputs=1:normalize=0[out]\" -map \"[out]\" \"/output/combined.wav\""

[Killed] ConditionalExpression
src/ffmpeg-utils.ts:52:20
     const adjustedTime = Math.max(0, seg.startTimeMs - offsetMs);
     // Apply volume reduction to UI sounds, with clicks louder than keypresses
     const volume = seg.type === 'narration' ? 1.0
-                 : seg.type === 'click' ? 0.5
+                 : true ? 0.5
                  : 0.05;
     return `[${i}]adelay=${adjustedTime}|${adjustedTime},volume=${volume}[a${i}]`;
killedBy: ffmpeg-utils concatAudioWithGaps should handle segments with keypress type
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "[0]adelay=1000|1000,volume=0.05[a0]"
Received string:    "ffmpeg -y -i \"/audio/keypress.wav\" -filter_complex \"[0]adelay=1000|1000,volume=0.5[a0];[a0]amix=inputs=1:normalize=0[out]\" -map \"[out]\" \"/output/combined.wav\""

[Killed] ConditionalExpression
src/ffmpeg-utils.ts:52:20
     const adjustedTime = Math.max(0, seg.startTimeMs - offsetMs);
     // Apply volume reduction to UI sounds, with clicks louder than keypresses
     const volume = seg.type === 'narration' ? 1.0
-                 : seg.type === 'click' ? 0.5
+                 : false ? 0.5
                  : 0.05;
     return `[${i}]adelay=${adjustedTime}|${adjustedTime},volume=${volume}[a${i}]`;
killedBy: ffmpeg-utils concatAudioWithGaps should build correct ffmpeg command for multiple segments
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "[1]adelay=2500|2500,volume=0.5[a1]"

[Killed] ArrowFunction
src/ffmpeg-utils.ts:57:40
     return `[${i}]adelay=${adjustedTime}|${adjustedTime},volume=${volume}[a${i}]`;
   });
 
-  const mixInputs = sortedSegments.map((_, i) => `[a${i}]`).join('');
+  const mixInputs = sortedSegments.map(() => undefined).join('');
   const filterComplex = `${filterParts.join(';')};${mixInputs}amix=inputs=${sortedSegments.length}:normalize=0[out]`;
 
killedBy: ffmpeg-utils concatAudioWithGaps should build correct ffmpeg command for single segment
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "[a0]amix=inputs=1:normalize=0[out]"
Received string:    "ffmpeg -y -i \"/audio/narration1.mp3\" -filter_complex \"[0]adelay=0|0,volume=1[a0];amix=inputs=1:normalize=0[out]\" -map \"[out]\" \"/output/combined.wav\""

[Killed] StringLiteral
src/ffmpeg-utils.ts:58:25
   });
 
   const mixInputs = sortedSegments.map((_, i) => `[a${i}]`).join('');
-  const filterComplex = `${filterParts.join(';')};${mixInputs}amix=inputs=${sortedSegments.length}:normalize=0[out]`;
+  const filterComplex = ``;
 
   const command = `ffmpeg -y ${inputs} -filter_complex "${filterComplex}" -map "[out]" "${outputPath}"`;
killedBy: ffmpeg-utils concatAudioWithGaps should build correct ffmpeg command for single segment
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "[0]adelay=0|0,volume=1[a0]"
Received string:    "ffmpeg -y -i \"/audio/narration1.mp3\" -filter_complex \"\" -map \"[out]\" \"/output/combined.wav\""

[Killed] UpdateOperator
src/ffmpeg-utils.ts:68:60
   // Log the adelay values being used (showing original and adjusted)
   // eslint-disable-next-line no-console
   console.log(`[FFMPEG] adelay values (first 10), offset=${offsetMs}ms:`);
-  for (let i = 0; i < Math.min(10, sortedSegments.length); i++) {
+  for (let i = 0; i < Math.min(10, sortedSegments.length); i--) {
     const adjustedTime = Math.max(0, sortedSegments[i].startTimeMs - offsetMs);
     // eslint-disable-next-line no-console
killedBy: ffmpeg-utils concatAudioWithGaps should build correct ffmpeg command for single segment
statusReason: TypeError: Cannot read properties of undefined (reading 'startTimeMs')

[Killed] MethodExpression
src/ffmpeg-utils.ts:68:23
   // Log the adelay values being used (showing original and adjusted)
   // eslint-disable-next-line no-console
   console.log(`[FFMPEG] adelay values (first 10), offset=${offsetMs}ms:`);
-  for (let i = 0; i < Math.min(10, sortedSegments.length); i++) {
+  for (let i = 0; i < Math.max(10, sortedSegments.length); i++) {
     const adjustedTime = Math.max(0, sortedSegments[i].startTimeMs - offsetMs);
     // eslint-disable-next-line no-console
killedBy: ffmpeg-utils concatAudioWithGaps should build correct ffmpeg command for single segment
statusReason: TypeError: Cannot read properties of undefined (reading 'startTimeMs')

[Survived] ArithmeticOperator
src/ffmpeg-utils.ts:69:38
   // eslint-disable-next-line no-console
   console.log(`[FFMPEG] adelay values (first 10), offset=${offsetMs}ms:`);
   for (let i = 0; i < Math.min(10, sortedSegments.length); i++) {
-    const adjustedTime = Math.max(0, sortedSegments[i].startTimeMs - offsetMs);
+    const adjustedTime = Math.max(0, sortedSegments[i].startTimeMs + offsetMs);
     // eslint-disable-next-line no-console
     console.log(`  [${i}] original=${sortedSegments[i].startTimeMs}ms -> adelay=${adjustedTime}ms`);

[Survived] MethodExpression
src/ffmpeg-utils.ts:69:26
   // eslint-disable-next-line no-console
   console.log(`[FFMPEG] adelay values (first 10), offset=${offsetMs}ms:`);
   for (let i = 0; i < Math.min(10, sortedSegments.length); i++) {
-    const adjustedTime = Math.max(0, sortedSegments[i].startTimeMs - offsetMs);
+    const adjustedTime = Math.min(0, sortedSegments[i].startTimeMs - offsetMs);
     // eslint-disable-next-line no-console
     console.log(`  [${i}] original=${sortedSegments[i].startTimeMs}ms -> adelay=${adjustedTime}ms`);

[Survived] StringLiteral
src/ffmpeg-utils.ts:71:17
   for (let i = 0; i < Math.min(10, sortedSegments.length); i++) {
     const adjustedTime = Math.max(0, sortedSegments[i].startTimeMs - offsetMs);
     // eslint-disable-next-line no-console
-    console.log(`  [${i}] original=${sortedSegments[i].startTimeMs}ms -> adelay=${adjustedTime}ms`);
+    console.log(``);
   }
 

[Killed] StringLiteral
src/ffmpeg-utils.ts:101:34
  */
 export async function detectSyncFrame(videoPath: string): Promise<number> {
   // Create temp directory for frame extraction
-  const tempDir = join(tmpdir(), `sync-detect-${Date.now()}`);
+  const tempDir = join(tmpdir(), ``);
   await mkdir(tempDir, { recursive: true });
 
killedBy: ffmpeg-utils detectSyncFrame should create temp directory and clean up after
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- StringContaining "sync-detect-",
+ "/tmp",
  {"recursive": true},

[Killed] BooleanLiteral
src/ffmpeg-utils.ts:102:37
 export async function detectSyncFrame(videoPath: string): Promise<number> {
   // Create temp directory for frame extraction
   const tempDir = join(tmpdir(), `sync-detect-${Date.now()}`);
-  await mkdir(tempDir, { recursive: true });
+  await mkdir(tempDir, { recursive: false });
 
   try {
killedBy: ffmpeg-utils detectSyncFrame should create temp directory and clean up after
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "/tmp/sync-detect-1770161513246",
  Object {
-   "recursive": true,

[Survived] MethodExpression
src/ffmpeg-utils.ts:108:24
     // Get video frame rate for timestamp calculation
     const probeCmd = `ffprobe -v error -select_streams v:0 -show_entries stream=r_frame_rate -of csv=p=0 "${videoPath}"`;
     const { stdout: fpsOutput } = await execAsync(probeCmd);
-    const [num, den] = fpsOutput.trim().split('/').map(Number);
+    const [num, den] = fpsOutput.split('/').map(Number);
     const fps = num / (den || 1);
     const frameDurationMs = 1000 / fps;

[Survived] ArithmeticOperator
src/ffmpeg-utils.ts:109:17
     const probeCmd = `ffprobe -v error -select_streams v:0 -show_entries stream=r_frame_rate -of csv=p=0 "${videoPath}"`;
     const { stdout: fpsOutput } = await execAsync(probeCmd);
     const [num, den] = fpsOutput.trim().split('/').map(Number);
-    const fps = num / (den || 1);
+    const fps = num * (den || 1);
     const frameDurationMs = 1000 / fps;
 

[Survived] LogicalOperator
src/ffmpeg-utils.ts:109:24
     const probeCmd = `ffprobe -v error -select_streams v:0 -show_entries stream=r_frame_rate -of csv=p=0 "${videoPath}"`;
     const { stdout: fpsOutput } = await execAsync(probeCmd);
     const [num, den] = fpsOutput.trim().split('/').map(Number);
-    const fps = num / (den || 1);
+    const fps = num / (den && 1);
     const frameDurationMs = 1000 / fps;
 

[Killed] ArithmeticOperator
src/ffmpeg-utils.ts:110:29
     const { stdout: fpsOutput } = await execAsync(probeCmd);
     const [num, den] = fpsOutput.trim().split('/').map(Number);
     const fps = num / (den || 1);
-    const frameDurationMs = 1000 / fps;
+    const frameDurationMs = 1000 * fps;
 
     // eslint-disable-next-line no-console
killedBy: ffmpeg-utils detectSyncFrame should return timestamp when sync frame is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 25000

[Killed] ArrowFunction
src/ffmpeg-utils.ts:121:37
 
     // Read extracted frames
     const files = await readdir(tempDir);
-    const frameFiles = files.filter(f => f.endsWith('.ppm')).sort();
+    const frameFiles = files.filter(() => undefined).sort();
 
     // eslint-disable-next-line no-console
killedBy: ffmpeg-utils detectSyncFrame should return timestamp when sync frame is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 0

[Killed] MethodExpression
src/ffmpeg-utils.ts:121:42
 
     // Read extracted frames
     const files = await readdir(tempDir);
-    const frameFiles = files.filter(f => f.endsWith('.ppm')).sort();
+    const frameFiles = files.filter(f => f.startsWith('.ppm')).sort();
 
     // eslint-disable-next-line no-console
killedBy: ffmpeg-utils detectSyncFrame should return timestamp when sync frame is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 0

[Survived] StringLiteral
src/ffmpeg-utils.ts:124:17
     const frameFiles = files.filter(f => f.endsWith('.ppm')).sort();
 
     // eslint-disable-next-line no-console
-    console.log(`[SYNC] Extracted ${frameFiles.length} frames for analysis`);
+    console.log(``);
 
     // Analyze each frame for magenta content

[Killed] UpdateOperator
src/ffmpeg-utils.ts:127:44
     console.log(`[SYNC] Extracted ${frameFiles.length} frames for analysis`);
 
     // Analyze each frame for magenta content
-    for (let i = 0; i < frameFiles.length; i++) {
+    for (let i = 0; i < frameFiles.length; i--) {
       const framePath = join(tempDir, frameFiles[i]);
       const isMagenta = await isFrameMagenta(framePath);
killedBy: ffmpeg-utils detectSyncFrame should return timestamp when sync frame is found
statusReason: TypeError: The "path" argument must be of type string. Received undefined

[Killed] EqualityOperator
src/ffmpeg-utils.ts:127:21
     console.log(`[SYNC] Extracted ${frameFiles.length} frames for analysis`);
 
     // Analyze each frame for magenta content
-    for (let i = 0; i < frameFiles.length; i++) {
+    for (let i = 0; i <= frameFiles.length; i++) {
       const framePath = join(tempDir, frameFiles[i]);
       const isMagenta = await isFrameMagenta(framePath);
killedBy: ffmpeg-utils detectSyncFrame should return 0 when no sync frame is detected
statusReason: TypeError: The "path" argument must be of type string. Received undefined

[Killed] ConditionalExpression
src/ffmpeg-utils.ts:131:11
       const framePath = join(tempDir, frameFiles[i]);
       const isMagenta = await isFrameMagenta(framePath);
 
-      if (isMagenta) {
+      if (false) {
         const timestampMs = i * frameDurationMs;
         // eslint-disable-next-line no-console
killedBy: ffmpeg-utils detectSyncFrame should return timestamp when sync frame is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 0

[Killed] ConditionalExpression
src/ffmpeg-utils.ts:131:11
       const framePath = join(tempDir, frameFiles[i]);
       const isMagenta = await isFrameMagenta(framePath);
 
-      if (isMagenta) {
+      if (true) {
         const timestampMs = i * frameDurationMs;
         // eslint-disable-next-line no-console
killedBy: ffmpeg-utils detectSyncFrame should return timestamp when sync frame is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 0

[Killed] ArithmeticOperator
src/ffmpeg-utils.ts:132:29
       const isMagenta = await isFrameMagenta(framePath);
 
       if (isMagenta) {
-        const timestampMs = i * frameDurationMs;
+        const timestampMs = i / frameDurationMs;
         // eslint-disable-next-line no-console
         console.log(`[SYNC] Found sync frame at frame ${i} (${timestampMs.toFixed(2)}ms)`);
killedBy: ffmpeg-utils detectSyncFrame should return timestamp when sync frame is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 0.025

[Survived] StringLiteral
src/ffmpeg-utils.ts:134:21
       if (isMagenta) {
         const timestampMs = i * frameDurationMs;
         // eslint-disable-next-line no-console
-        console.log(`[SYNC] Found sync frame at frame ${i} (${timestampMs.toFixed(2)}ms)`);
+        console.log(``);
         return timestampMs;
       }

[Survived] StringLiteral
src/ffmpeg-utils.ts:140:17
     }
 
     // eslint-disable-next-line no-console
-    console.log('[SYNC] No sync frame detected, returning 0');
+    console.log("");
     return 0;
   } finally {

[Killed] BlockStatement
src/ffmpeg-utils.ts:142:13
     // eslint-disable-next-line no-console
     console.log('[SYNC] No sync frame detected, returning 0');
     return 0;
-  } finally {
-    // Cleanup temp directory
-    try {
-      const files = await readdir(tempDir);
-      for (const file of files) {
-        await unlink(join(tempDir, file));
-      }
-      await rmdir(tempDir);
-    } catch {
-      // Ignore cleanup errors
-    }
-  }
+  } finally {}
 }
 
killedBy: ffmpeg-utils detectSyncFrame should handle ffprobe output with denominator of 0
statusReason: Error: Cleanup failed

[Killed] BlockStatement
src/ffmpeg-utils.ts:144:9
     return 0;
   } finally {
     // Cleanup temp directory
-    try {
-      const files = await readdir(tempDir);
-      for (const file of files) {
-        await unlink(join(tempDir, file));
-      }
-      await rmdir(tempDir);
-    } catch {
+    try {} catch {
       // Ignore cleanup errors
     }
killedBy: ffmpeg-utils detectSyncFrame should handle ffprobe output with denominator of 0
statusReason: Error: Cleanup failed

[Survived] BlockStatement
src/ffmpeg-utils.ts:146:33
     // Cleanup temp directory
     try {
       const files = await readdir(tempDir);
-      for (const file of files) {
-        await unlink(join(tempDir, file));
-      }
+      for (const file of files) {}
       await rmdir(tempDir);
     } catch {

[Killed] EqualityOperator
src/ffmpeg-utils.ts:169:38
   let headerEnd = 0;
   let newlineCount = 0;
 
-  for (let i = 0; i < data.length && newlineCount < 3; i++) {
+  for (let i = 0; i < data.length && newlineCount >= 3; i++) {
     if (data[i] === 0x0a) { // newline
       newlineCount++;
killedBy: ffmpeg-utils detectSyncFrame should return timestamp when sync frame is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 0

[Killed] ConditionalExpression
src/ffmpeg-utils.ts:169:19
   let headerEnd = 0;
   let newlineCount = 0;
 
-  for (let i = 0; i < data.length && newlineCount < 3; i++) {
+  for (let i = 0; false; i++) {
     if (data[i] === 0x0a) { // newline
       newlineCount++;
killedBy: ffmpeg-utils detectSyncFrame should return timestamp when sync frame is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 0

[Killed] ConditionalExpression
src/ffmpeg-utils.ts:170:9
   let newlineCount = 0;
 
   for (let i = 0; i < data.length && newlineCount < 3; i++) {
-    if (data[i] === 0x0a) { // newline
+    if (true) { // newline
       newlineCount++;
       if (newlineCount === 3) {
killedBy: ffmpeg-utils detectSyncFrame should return timestamp when sync frame is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 0
