[Killed] ConditionalExpression
src/ffmpeg-utils.ts:170:9
   let newlineCount = 0;
 
   for (let i = 0; i < data.length && newlineCount < 3; i++) {
-    if (data[i] === 0x0a) { // newline
+    if (false) { // newline
       newlineCount++;
       if (newlineCount === 3) {
killedBy: ffmpeg-utils detectSyncFrame should return timestamp when sync frame is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 0

[Killed] UpdateOperator
src/ffmpeg-utils.ts:171:7
 
   for (let i = 0; i < data.length && newlineCount < 3; i++) {
     if (data[i] === 0x0a) { // newline
-      newlineCount++;
+      newlineCount--;
       if (newlineCount === 3) {
         headerEnd = i + 1;
killedBy: ffmpeg-utils detectSyncFrame should return timestamp when sync frame is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 0

[Killed] BlockStatement
src/ffmpeg-utils.ts:172:31
   for (let i = 0; i < data.length && newlineCount < 3; i++) {
     if (data[i] === 0x0a) { // newline
       newlineCount++;
-      if (newlineCount === 3) {
-        headerEnd = i + 1;
-        break;
-      }
+      if (newlineCount === 3) {}
     }
   }
killedBy: ffmpeg-utils detectSyncFrame should return timestamp when sync frame is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 0

[Killed] EqualityOperator
src/ffmpeg-utils.ts:172:11
   for (let i = 0; i < data.length && newlineCount < 3; i++) {
     if (data[i] === 0x0a) { // newline
       newlineCount++;
-      if (newlineCount === 3) {
+      if (newlineCount !== 3) {
         headerEnd = i + 1;
         break;
killedBy: ffmpeg-utils detectSyncFrame should return timestamp when sync frame is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 0

[Killed] ArithmeticOperator
src/ffmpeg-utils.ts:173:21
     if (data[i] === 0x0a) { // newline
       newlineCount++;
       if (newlineCount === 3) {
-        headerEnd = i + 1;
+        headerEnd = i - 1;
         break;
       }
killedBy: ffmpeg-utils detectSyncFrame should return timestamp when sync frame is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 0

[Killed] MethodExpression
src/ffmpeg-utils.ts:180:21
   }
 
   // Pixel data starts after header
-  const pixelData = data.slice(headerEnd);
+  const pixelData = data;
   const totalPixels = pixelData.length / 3;
 
killedBy: ffmpeg-utils detectSyncFrame should return timestamp when sync frame is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 0

[Killed] ArithmeticOperator
src/ffmpeg-utils.ts:181:23
 
   // Pixel data starts after header
   const pixelData = data.slice(headerEnd);
-  const totalPixels = pixelData.length / 3;
+  const totalPixels = pixelData.length * 3;
 
   // Count magenta pixels (allowing some tolerance for compression artifacts)
killedBy: ffmpeg-utils detectSyncFrame should return timestamp when sync frame is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 0

[Killed] BlockStatement
src/ffmpeg-utils.ts:187:49
   let magentaCount = 0;
   const tolerance = 30; // Allow +/- 30 in RGB values
 
-  for (let i = 0; i < pixelData.length; i += 3) {
-    const r = pixelData[i];
-    const g = pixelData[i + 1];
-    const b = pixelData[i + 2];
-
-    const rMatch = Math.abs(r - SYNC_MARKER_R) < tolerance;
-    const gMatch = g < tolerance; // G should be near 0
-    const bMatch = Math.abs(b - SYNC_MARKER_B) < tolerance;
-
-    if (rMatch && gMatch && bMatch) {
-      magentaCount++;
-    }
-  }
+  for (let i = 0; i < pixelData.length; i += 3) {}
 
   const magentaRatio = magentaCount / totalPixels;
killedBy: ffmpeg-utils detectSyncFrame should return timestamp when sync frame is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 0

[Killed] ConditionalExpression
src/ffmpeg-utils.ts:187:19
   let magentaCount = 0;
   const tolerance = 30; // Allow +/- 30 in RGB values
 
-  for (let i = 0; i < pixelData.length; i += 3) {
+  for (let i = 0; false; i += 3) {
     const r = pixelData[i];
     const g = pixelData[i + 1];
killedBy: ffmpeg-utils detectSyncFrame should return timestamp when sync frame is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 0

[Killed] ArithmeticOperator
src/ffmpeg-utils.ts:189:25
 
   for (let i = 0; i < pixelData.length; i += 3) {
     const r = pixelData[i];
-    const g = pixelData[i + 1];
+    const g = pixelData[i - 1];
     const b = pixelData[i + 2];
 
killedBy: ffmpeg-utils detectSyncFrame should return timestamp when sync frame is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 0

[Killed] ArithmeticOperator
src/ffmpeg-utils.ts:190:25
   for (let i = 0; i < pixelData.length; i += 3) {
     const r = pixelData[i];
     const g = pixelData[i + 1];
-    const b = pixelData[i + 2];
+    const b = pixelData[i - 2];
 
     const rMatch = Math.abs(r - SYNC_MARKER_R) < tolerance;
killedBy: ffmpeg-utils detectSyncFrame should return timestamp when sync frame is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 0

[Killed] EqualityOperator
src/ffmpeg-utils.ts:192:20
     const g = pixelData[i + 1];
     const b = pixelData[i + 2];
 
-    const rMatch = Math.abs(r - SYNC_MARKER_R) < tolerance;
+    const rMatch = Math.abs(r - SYNC_MARKER_R) >= tolerance;
     const gMatch = g < tolerance; // G should be near 0
     const bMatch = Math.abs(b - SYNC_MARKER_B) < tolerance;
killedBy: ffmpeg-utils detectSyncFrame should return timestamp when sync frame is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 0

[Killed] ArithmeticOperator
src/ffmpeg-utils.ts:192:29
     const g = pixelData[i + 1];
     const b = pixelData[i + 2];
 
-    const rMatch = Math.abs(r - SYNC_MARKER_R) < tolerance;
+    const rMatch = Math.abs(r + SYNC_MARKER_R) < tolerance;
     const gMatch = g < tolerance; // G should be near 0
     const bMatch = Math.abs(b - SYNC_MARKER_B) < tolerance;
killedBy: ffmpeg-utils detectSyncFrame should return timestamp when sync frame is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 0

[Killed] EqualityOperator
src/ffmpeg-utils.ts:193:20
     const b = pixelData[i + 2];
 
     const rMatch = Math.abs(r - SYNC_MARKER_R) < tolerance;
-    const gMatch = g < tolerance; // G should be near 0
+    const gMatch = g >= tolerance; // G should be near 0
     const bMatch = Math.abs(b - SYNC_MARKER_B) < tolerance;
 
killedBy: ffmpeg-utils detectSyncFrame should return timestamp when sync frame is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 0

[Killed] ConditionalExpression
src/ffmpeg-utils.ts:193:20
     const b = pixelData[i + 2];
 
     const rMatch = Math.abs(r - SYNC_MARKER_R) < tolerance;
-    const gMatch = g < tolerance; // G should be near 0
+    const gMatch = false; // G should be near 0
     const bMatch = Math.abs(b - SYNC_MARKER_B) < tolerance;
 
killedBy: ffmpeg-utils detectSyncFrame should return timestamp when sync frame is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 0

[Killed] ArithmeticOperator
src/ffmpeg-utils.ts:194:29
 
     const rMatch = Math.abs(r - SYNC_MARKER_R) < tolerance;
     const gMatch = g < tolerance; // G should be near 0
-    const bMatch = Math.abs(b - SYNC_MARKER_B) < tolerance;
+    const bMatch = Math.abs(b + SYNC_MARKER_B) < tolerance;
 
     if (rMatch && gMatch && bMatch) {
killedBy: ffmpeg-utils detectSyncFrame should return timestamp when sync frame is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 0

[Killed] EqualityOperator
src/ffmpeg-utils.ts:194:20
 
     const rMatch = Math.abs(r - SYNC_MARKER_R) < tolerance;
     const gMatch = g < tolerance; // G should be near 0
-    const bMatch = Math.abs(b - SYNC_MARKER_B) < tolerance;
+    const bMatch = Math.abs(b - SYNC_MARKER_B) >= tolerance;
 
     if (rMatch && gMatch && bMatch) {
killedBy: ffmpeg-utils detectSyncFrame should return timestamp when sync frame is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 0

[Killed] BlockStatement
src/ffmpeg-utils.ts:196:37
     const gMatch = g < tolerance; // G should be near 0
     const bMatch = Math.abs(b - SYNC_MARKER_B) < tolerance;
 
-    if (rMatch && gMatch && bMatch) {
-      magentaCount++;
-    }
+    if (rMatch && gMatch && bMatch) {}
   }
 
killedBy: ffmpeg-utils detectSyncFrame should return timestamp when sync frame is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 0

[Killed] ConditionalExpression
src/ffmpeg-utils.ts:196:9
     const gMatch = g < tolerance; // G should be near 0
     const bMatch = Math.abs(b - SYNC_MARKER_B) < tolerance;
 
-    if (rMatch && gMatch && bMatch) {
+    if (true) {
       magentaCount++;
     }
killedBy: ffmpeg-utils detectSyncFrame should return timestamp when sync frame is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 0

[Killed] UpdateOperator
src/ffmpeg-utils.ts:197:7
     const bMatch = Math.abs(b - SYNC_MARKER_B) < tolerance;
 
     if (rMatch && gMatch && bMatch) {
-      magentaCount++;
+      magentaCount--;
     }
   }
killedBy: ffmpeg-utils detectSyncFrame should return timestamp when sync frame is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 0

[Survived] ArithmeticOperator
src/ffmpeg-utils.ts:201:24
     }
   }
 
-  const magentaRatio = magentaCount / totalPixels;
+  const magentaRatio = magentaCount * totalPixels;
   return magentaRatio >= SYNC_MARKER_THRESHOLD;
 }

[Killed] ConditionalExpression
src/ffmpeg-utils.ts:202:10
   }
 
   const magentaRatio = magentaCount / totalPixels;
-  return magentaRatio >= SYNC_MARKER_THRESHOLD;
+  return false;
 }
 
killedBy: ffmpeg-utils detectSyncFrame should return timestamp when sync frame is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 0

[Killed] EqualityOperator
src/ffmpeg-utils.ts:202:10
   }
 
   const magentaRatio = magentaCount / totalPixels;
-  return magentaRatio >= SYNC_MARKER_THRESHOLD;
+  return magentaRatio < SYNC_MARKER_THRESHOLD;
 }
 
killedBy: ffmpeg-utils detectSyncFrame should return timestamp when sync frame is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 0

[Survived] BooleanLiteral
src/ffmpeg-utils.ts:217:37
 }> {
   // Create temp directory for frame extraction
   const tempDir = join(tmpdir(), `sync-range-${Date.now()}`);
-  await mkdir(tempDir, { recursive: true });
+  await mkdir(tempDir, { recursive: false });
 
   try {

[Killed] UnaryOperator
src/ffmpeg-utils.ts:234:26
     const files = await readdir(tempDir);
     const frameFiles = files.filter(f => f.endsWith('.ppm')).sort();
 
-    let firstSyncFrame = -1;
+    let firstSyncFrame = +1;
     let lastSyncFrame = -1;
 
killedBy: ffmpeg-utils detectSyncFrameRange should return -1 for both frames when no sync marker found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -1
Received: 1

[Killed] UnaryOperator
src/ffmpeg-utils.ts:235:25
     const frameFiles = files.filter(f => f.endsWith('.ppm')).sort();
 
     let firstSyncFrame = -1;
-    let lastSyncFrame = -1;
+    let lastSyncFrame = +1;
 
     for (let i = 0; i < frameFiles.length; i++) {
killedBy: ffmpeg-utils detectSyncFrameRange should return -1 for both frames when no sync marker found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -1
Received: 1

[Killed] EqualityOperator
src/ffmpeg-utils.ts:237:21
     let firstSyncFrame = -1;
     let lastSyncFrame = -1;
 
-    for (let i = 0; i < frameFiles.length; i++) {
+    for (let i = 0; i <= frameFiles.length; i++) {
       const framePath = join(tempDir, frameFiles[i]);
       const isMagenta = await isFrameMagenta(framePath);
killedBy: ffmpeg-utils detectSyncFrameRange should return -1 for both frames when no sync marker found
statusReason: TypeError: The "path" argument must be of type string. Received undefined

[Killed] UpdateOperator
src/ffmpeg-utils.ts:237:44
     let firstSyncFrame = -1;
     let lastSyncFrame = -1;
 
-    for (let i = 0; i < frameFiles.length; i++) {
+    for (let i = 0; i < frameFiles.length; i--) {
       const framePath = join(tempDir, frameFiles[i]);
       const isMagenta = await isFrameMagenta(framePath);
killedBy: ffmpeg-utils detectSyncFrameRange should return -1 for both frames when no sync marker found
statusReason: TypeError: The "path" argument must be of type string. Received undefined

[Killed] BlockStatement
src/ffmpeg-utils.ts:241:22
       const framePath = join(tempDir, frameFiles[i]);
       const isMagenta = await isFrameMagenta(framePath);
 
-      if (isMagenta) {
-        if (firstSyncFrame === -1) {
-          firstSyncFrame = i;
-        }
-        lastSyncFrame = i;
-      } else if (firstSyncFrame !== -1) {
+      if (isMagenta) {} else if (firstSyncFrame !== -1) {
         // We've passed the sync marker sequence
         break;
killedBy: ffmpeg-utils detectSyncFrameRange should find sync frame range correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] ConditionalExpression
src/ffmpeg-utils.ts:242:13
       const isMagenta = await isFrameMagenta(framePath);
 
       if (isMagenta) {
-        if (firstSyncFrame === -1) {
+        if (true) {
           firstSyncFrame = i;
         }
killedBy: ffmpeg-utils detectSyncFrameRange should find sync frame range correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 3

[Killed] EqualityOperator
src/ffmpeg-utils.ts:242:13
       const isMagenta = await isFrameMagenta(framePath);
 
       if (isMagenta) {
-        if (firstSyncFrame === -1) {
+        if (firstSyncFrame !== -1) {
           firstSyncFrame = i;
         }
killedBy: ffmpeg-utils detectSyncFrameRange should find sync frame range correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] UnaryOperator
src/ffmpeg-utils.ts:246:37
           firstSyncFrame = i;
         }
         lastSyncFrame = i;
-      } else if (firstSyncFrame !== -1) {
+      } else if (firstSyncFrame !== +1) {
         // We've passed the sync marker sequence
         break;
killedBy: ffmpeg-utils detectSyncFrameRange should find sync frame range correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] EqualityOperator
src/ffmpeg-utils.ts:246:18
           firstSyncFrame = i;
         }
         lastSyncFrame = i;
-      } else if (firstSyncFrame !== -1) {
+      } else if (firstSyncFrame === -1) {
         // We've passed the sync marker sequence
         break;
killedBy: ffmpeg-utils detectSyncFrameRange should find sync frame range correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Survived] BlockStatement
src/ffmpeg-utils.ts:253:13
     }
 
     return { firstSyncFrame, lastSyncFrame, frameDurationMs };
-  } finally {
-    // Cleanup
-    try {
-      const files = await readdir(tempDir);
-      for (const file of files) {
-        await unlink(join(tempDir, file));
-      }
-      await rmdir(tempDir);
-    } catch {
-      // Ignore cleanup errors
-    }
-  }
+  } finally {}
 }
 

[Survived] BlockStatement
src/ffmpeg-utils.ts:255:9
     return { firstSyncFrame, lastSyncFrame, frameDurationMs };
   } finally {
     // Cleanup
-    try {
-      const files = await readdir(tempDir);
-      for (const file of files) {
-        await unlink(join(tempDir, file));
-      }
-      await rmdir(tempDir);
-    } catch {
+    try {} catch {
       // Ignore cleanup errors
     }

[Killed] BlockStatement
src/ffmpeg-utils.ts:279:18
   outputPath: string,
   framesToTrim: number,
   frameDurationMs: number
-): Promise<void> {
-  if (framesToTrim <= 0) {
-    // No trimming needed, just copy (re-encode to mp4 for compatibility)
-    const copyCmd = `ffmpeg -y -i "${inputPath}" -c:v libx264 -preset fast -crf 23 "${outputPath}"`;
-    await execAsync(copyCmd);
-    return;
-  }
-
-  // Calculate start time in seconds
-  const startTimeSeconds = (framesToTrim * frameDurationMs) / 1000;
-
-  // eslint-disable-next-line no-console
-  console.log(`[SYNC] Trimming ${framesToTrim} frames (${startTimeSeconds.toFixed(3)}s) from video`);
-
-  // Use ffmpeg to trim the video
-  // -ss before -i for fast seeking, but we need frame-accurate trimming so put it after
-  // Output as MP4 with H.264 for compatibility
-  const trimCmd = `ffmpeg -y -i "${inputPath}" -ss ${startTimeSeconds.toFixed(3)} -c:v libx264 -preset fast -crf 23 "${outputPath}"`;
-  await execAsync(trimCmd);
-}
+): Promise<void> {}
 
killedBy: ffmpeg-utils trimSyncFrames should copy video without trimming when framesToTrim is 0
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
src/ffmpeg-utils.ts:280:7
   framesToTrim: number,
   frameDurationMs: number
 ): Promise<void> {
-  if (framesToTrim <= 0) {
+  if (true) {
     // No trimming needed, just copy (re-encode to mp4 for compatibility)
     const copyCmd = `ffmpeg -y -i "${inputPath}" -c:v libx264 -preset fast -crf 23 "${outputPath}"`;
killedBy: ffmpeg-utils trimSyncFrames should trim video with correct start time
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "-ss 0.400"
Received string:    "ffmpeg -y -i \"/input/video.webm\" -c:v libx264 -preset fast -crf 23 \"/output/video.mp4\""

[Killed] ConditionalExpression
src/ffmpeg-utils.ts:280:7
   framesToTrim: number,
   frameDurationMs: number
 ): Promise<void> {
-  if (framesToTrim <= 0) {
+  if (false) {
     // No trimming needed, just copy (re-encode to mp4 for compatibility)
     const copyCmd = `ffmpeg -y -i "${inputPath}" -c:v libx264 -preset fast -crf 23 "${outputPath}"`;
killedBy: ffmpeg-utils trimSyncFrames should copy video without trimming when framesToTrim is 0
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "-ss"
Received string:        "ffmpeg -y -i \"/input/video.webm\" -ss 0.000 -c:v libx264 -preset fast -crf 23 \"/output/video.mp4\""

[Killed] ArithmeticOperator
src/ffmpeg-utils.ts:288:28
   }
 
   // Calculate start time in seconds
-  const startTimeSeconds = (framesToTrim * frameDurationMs) / 1000;
+  const startTimeSeconds = framesToTrim * frameDurationMs * 1000;
 
   // eslint-disable-next-line no-console
killedBy: ffmpeg-utils trimSyncFrames should trim video with correct start time
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "-ss 0.400"
Received string:    "ffmpeg -y -i \"/input/video.webm\" -ss 400000.000 -c:v libx264 -preset fast -crf 23 \"/output/video.mp4\""

[Killed] ArithmeticOperator
src/ffmpeg-utils.ts:288:29
   }
 
   // Calculate start time in seconds
-  const startTimeSeconds = (framesToTrim * frameDurationMs) / 1000;
+  const startTimeSeconds = (framesToTrim / frameDurationMs) / 1000;
 
   // eslint-disable-next-line no-console
killedBy: ffmpeg-utils trimSyncFrames should trim video with correct start time
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "-ss 0.400"
Received string:    "ffmpeg -y -i \"/input/video.webm\" -ss 0.000 -c:v libx264 -preset fast -crf 23 \"/output/video.mp4\""

[Survived] StringLiteral
src/ffmpeg-utils.ts:291:15
   const startTimeSeconds = (framesToTrim * frameDurationMs) / 1000;
 
   // eslint-disable-next-line no-console
-  console.log(`[SYNC] Trimming ${framesToTrim} frames (${startTimeSeconds.toFixed(3)}s) from video`);
+  console.log(``);
 
   // Use ffmpeg to trim the video
