[Killed] BlockStatement
src/demo-builder.ts:31:68
     this.state = state;
   }
 
-  private recordTimestampAt(type: SoundType, timeMs: number): void {
-    this.pendingSoundTimestamps.push({ type, timeMs });
-  }
+  private recordTimestampAt(type: SoundType, timeMs: number): void {}
 
   /**
killedBy: NarratedDemo sounds feature should record keypress timestamps through SoundEnabledPage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringMatching /^keypress-letter-[1-5]$/

Number of calls: 0

[Killed] BlockStatement
src/demo-builder.ts:38:42
   /**
    * Navigate to a URL
    */
-  async goto(url: string): Promise<void> {
-    await this.originalPage.goto(url);
-  }
+  async goto(url: string): Promise<void> {}
 
   /**
killedBy: NarratedDemo SoundEnabledPage should delegate goto to original page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://example.com"
Received: "http://localhost:3000"

Number of calls: 1

[Killed] BlockStatement
src/demo-builder.ts:46:48
    * Click an element and record the click timestamp
    * Uses smooth scrolling and human-like reaction delay
    */
-  async click(selector: string): Promise<void> {
-    // Smooth scroll into view using Playwright's locator
-    const locator = this.originalPage.locator(selector);
-    await locator.scrollIntoViewIfNeeded();
-
-    // Add extra delay to simulate smooth scrolling feel
-    await this.originalPage.waitForTimeout(200);
-
-    // Human reaction delay (100-200ms)
-    await this.originalPage.waitForTimeout(100 + Math.random() * 100);
-
-    this.recordTimestamp('click');
-    await this.originalPage.click(selector);
-  }
+  async click(selector: string): Promise<void> {}
 
   /**
killedBy: NarratedDemo sounds feature should record click timestamps through SoundEnabledPage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "click"

Number of calls: 0

[Survived] ArithmeticOperator
src/demo-builder.ts:55:44
     await this.originalPage.waitForTimeout(200);
 
     // Human reaction delay (100-200ms)
-    await this.originalPage.waitForTimeout(100 + Math.random() * 100);
+    await this.originalPage.waitForTimeout(100 - Math.random() * 100);
 
     this.recordTimestamp('click');

[Survived] ArithmeticOperator
src/demo-builder.ts:55:50
     await this.originalPage.waitForTimeout(200);
 
     // Human reaction delay (100-200ms)
-    await this.originalPage.waitForTimeout(100 + Math.random() * 100);
+    await this.originalPage.waitForTimeout(100 + Math.random() / 100);
 
     this.recordTimestamp('click');

[Killed] ConditionalExpression
src/demo-builder.ts:66:9
    * Uses round-robin selection for letters and spaces to avoid repetitive sounds
    */
   private getSoundTypeForChar(char: string): SoundType {
-    if (char === ' ') return getVariantSoundType('keypress-space');
+    if (true) return getVariantSoundType('keypress-space');
     if (char === '\n' || char === '\r') return 'keypress-return';
     return getVariantSoundType('keypress-letter');
killedBy: NarratedDemo sounds feature should record keypress timestamps through SoundEnabledPage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringMatching /^keypress-letter-[1-5]$/
Received
       1: "keypress-space-1"
       2: "keypress-space-2"

Number of calls: 2

[Killed] ConditionalExpression
src/demo-builder.ts:66:9
    * Uses round-robin selection for letters and spaces to avoid repetitive sounds
    */
   private getSoundTypeForChar(char: string): SoundType {
-    if (char === ' ') return getVariantSoundType('keypress-space');
+    if (false) return getVariantSoundType('keypress-space');
     if (char === '\n' || char === '\r') return 'keypress-return';
     return getVariantSoundType('keypress-letter');
killedBy: NarratedDemo sounds feature should handle space characters with keypress-space sound
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringMatching /^keypress-space-[1-5]$/
Received
       1: "keypress-letter-4"
       2: "keypress-letter-5"
       3: "keypress-letter-1"

[Killed] EqualityOperator
src/demo-builder.ts:67:26
    */
   private getSoundTypeForChar(char: string): SoundType {
     if (char === ' ') return getVariantSoundType('keypress-space');
-    if (char === '\n' || char === '\r') return 'keypress-return';
+    if (char === '\n' || char !== '\r') return 'keypress-return';
     return getVariantSoundType('keypress-letter');
   }
killedBy: NarratedDemo sounds feature should record keypress timestamps through SoundEnabledPage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringMatching /^keypress-letter-[1-5]$/
Received: "keypress-return"

Number of calls: 1

[Killed] ConditionalExpression
src/demo-builder.ts:67:9
    */
   private getSoundTypeForChar(char: string): SoundType {
     if (char === ' ') return getVariantSoundType('keypress-space');
-    if (char === '\n' || char === '\r') return 'keypress-return';
+    if (false) return 'keypress-return';
     return getVariantSoundType('keypress-letter');
   }
killedBy: NarratedDemo sounds feature should handle return/newline characters with keypress-return sound
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "keypress-return"
Received
       1: "keypress-letter-2"
       2: "keypress-letter-3"

Number of calls: 2

[Survived] ArithmeticOperator
src/demo-builder.ts:78:20
     let delay = baseDelay;
 
     // 1. Random variation (+/- 30%)
-    delay *= 0.7 + Math.random() * 0.6;
+    delay *= 0.7 + Math.random() / 0.6;
 
     // 2. Common digraphs are faster (th, er, on, an, etc.)

[Survived] ArithmeticOperator
src/demo-builder.ts:78:14
     let delay = baseDelay;
 
     // 1. Random variation (+/- 30%)
-    delay *= 0.7 + Math.random() * 0.6;
+    delay *= 0.7 - Math.random() * 0.6;
 
     // 2. Common digraphs are faster (th, er, on, an, etc.)

[Survived] StringLiteral
src/demo-builder.ts:81:57
     delay *= 0.7 + Math.random() * 0.6;
 
     // 2. Common digraphs are faster (th, er, on, an, etc.)
-    const fastDigraphs = ['th', 'er', 'on', 'an', 'en', 'in', 're', 'he', 'ed', 'nd'];
+    const fastDigraphs = ['th', 'er', 'on', 'an', 'en', "", 're', 'he', 'ed', 'nd'];
     if (fastDigraphs.includes((prevChar + currentChar).toLowerCase())) {
       delay *= 0.7;

[Survived] StringLiteral
src/demo-builder.ts:81:63
     delay *= 0.7 + Math.random() * 0.6;
 
     // 2. Common digraphs are faster (th, er, on, an, etc.)
-    const fastDigraphs = ['th', 'er', 'on', 'an', 'en', 'in', 're', 'he', 'ed', 'nd'];
+    const fastDigraphs = ['th', 'er', 'on', 'an', 'en', 'in', "", 'he', 'ed', 'nd'];
     if (fastDigraphs.includes((prevChar + currentChar).toLowerCase())) {
       delay *= 0.7;

[Survived] MethodExpression
src/demo-builder.ts:82:31
 
     // 2. Common digraphs are faster (th, er, on, an, etc.)
     const fastDigraphs = ['th', 'er', 'on', 'an', 'en', 'in', 're', 'he', 'ed', 'nd'];
-    if (fastDigraphs.includes((prevChar + currentChar).toLowerCase())) {
+    if (fastDigraphs.includes((prevChar + currentChar).toUpperCase())) {
       delay *= 0.7;
     }

[Survived] ConditionalExpression
src/demo-builder.ts:82:9
 
     // 2. Common digraphs are faster (th, er, on, an, etc.)
     const fastDigraphs = ['th', 'er', 'on', 'an', 'en', 'in', 're', 'he', 'ed', 'nd'];
-    if (fastDigraphs.includes((prevChar + currentChar).toLowerCase())) {
+    if (true) {
       delay *= 0.7;
     }

[Survived] AssignmentOperator
src/demo-builder.ts:83:7
     // 2. Common digraphs are faster (th, er, on, an, etc.)
     const fastDigraphs = ['th', 'er', 'on', 'an', 'en', 'in', 're', 'he', 'ed', 'nd'];
     if (fastDigraphs.includes((prevChar + currentChar).toLowerCase())) {
-      delay *= 0.7;
+      delay /= 0.7;
     }
 

[Survived] ConditionalExpression
src/demo-builder.ts:87:9
     }
 
     // 3. After space = slight pause (thinking)
-    if (prevChar === ' ') {
+    if (false) {
       delay *= 1.3;
     }

[Survived] BlockStatement
src/demo-builder.ts:87:27
     }
 
     // 3. After space = slight pause (thinking)
-    if (prevChar === ' ') {
-      delay *= 1.3;
-    }
+    if (prevChar === ' ') {}
 
     // 4. Punctuation followed by longer pause

[Survived] AssignmentOperator
src/demo-builder.ts:88:7
 
     // 3. After space = slight pause (thinking)
     if (prevChar === ' ') {
-      delay *= 1.3;
+      delay /= 1.3;
     }
 

[Survived] ConditionalExpression
src/demo-builder.ts:92:9
     }
 
     // 4. Punctuation followed by longer pause
-    if (['.', ',', '!', '?'].includes(prevChar)) {
+    if (true) {
       delay *= 1.5;
     }

[Survived] BlockStatement
src/demo-builder.ts:92:50
     }
 
     // 4. Punctuation followed by longer pause
-    if (['.', ',', '!', '?'].includes(prevChar)) {
-      delay *= 1.5;
-    }
+    if (['.', ',', '!', '?'].includes(prevChar)) {}
 
     return Math.round(delay);

[Survived] AssignmentOperator
src/demo-builder.ts:93:7
 
     // 4. Punctuation followed by longer pause
     if (['.', ',', '!', '?'].includes(prevChar)) {
-      delay *= 1.5;
+      delay /= 1.5;
     }
 

[Killed] EqualityOperator
src/demo-builder.ts:108:21
 
     const baseDelay = options?.delay ?? 150; // Default 220ms base for ~45 WPM typing
 
-    for (let i = 0; i < text.length; i++) {
+    for (let i = 0; i <= text.length; i++) {
       const currentChar = text[i];
       const prevChar = i > 0 ? text[i - 1] : '';
killedBy: NarratedDemo sounds feature should handle text with common digraphs (th, er, etc.) for faster typing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 3
Received number of calls: 4

[Survived] EqualityOperator
src/demo-builder.ts:110:24
 
     for (let i = 0; i < text.length; i++) {
       const currentChar = text[i];
-      const prevChar = i > 0 ? text[i - 1] : '';
+      const prevChar = i <= 0 ? text[i - 1] : '';
 
       // Record timestamp BEFORE typing - sound should start as keystroke begins

[Survived] ConditionalExpression
src/demo-builder.ts:110:24
 
     for (let i = 0; i < text.length; i++) {
       const currentChar = text[i];
-      const prevChar = i > 0 ? text[i - 1] : '';
+      const prevChar = true ? text[i - 1] : '';
 
       // Record timestamp BEFORE typing - sound should start as keystroke begins

[Survived] ArithmeticOperator
src/demo-builder.ts:116:22
       // Recording after causes drift since page.type() has internal latency
       // Use syncTime for audio alignment - this is when the sync marker was shown
       const soundType = this.getSoundTypeForChar(currentChar);
-      const timeMs = Date.now() - this.state.syncTime;
+      const timeMs = Date.now() + this.state.syncTime;
       // eslint-disable-next-line no-console
       console.log(`[SOUND] ${soundType} for '${currentChar}' at ${timeMs}ms (relative to sync marker)`);

[Survived] ArithmeticOperator
src/demo-builder.ts:125:15
       await this.originalPage.type(selector, currentChar);
 
       // Wait between characters with variable timing (except after the last one)
-      if (i < text.length - 1) {
+      if (i < text.length + 1) {
         const delay = this.getKeypressDelay(prevChar, currentChar, baseDelay);
         await this.originalPage.waitForTimeout(delay);

[Survived] ConditionalExpression
src/demo-builder.ts:125:11
       await this.originalPage.type(selector, currentChar);
 
       // Wait between characters with variable timing (except after the last one)
-      if (i < text.length - 1) {
+      if (false) {
         const delay = this.getKeypressDelay(prevChar, currentChar, baseDelay);
         await this.originalPage.waitForTimeout(delay);

[Killed] BlockStatement
src/demo-builder.ts:135:62
   /**
    * Fill an input element (faster than type, no individual keystrokes)
    */
-  async fill(selector: string, value: string): Promise<void> {
-    await this.originalPage.locator(selector).scrollIntoViewIfNeeded();
-    await this.originalPage.fill(selector, value);
-  }
+  async fill(selector: string, value: string): Promise<void> {}
 
   /**
killedBy: NarratedDemo SoundEnabledPage should delegate fill to original page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "#input", "value"

Number of calls: 0

[Killed] BlockStatement
src/demo-builder.ts:150:58
   /**
    * Wait for a selector to appear
    */
-  async waitForSelector(selector: string): Promise<void> {
-    await this.originalPage.waitForSelector(selector);
-  }
+  async waitForSelector(selector: string): Promise<void> {}
 
   /**
killedBy: NarratedDemo SoundEnabledPage should delegate waitForSelector to original page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "#loading"

Number of calls: 0

[Survived] BlockStatement
src/demo-builder.ts:157:56
   /**
    * Wait for a specific timeout
    */
-  async waitForTimeout(timeout: number): Promise<void> {
-    await this.originalPage.waitForTimeout(timeout);
-  }
+  async waitForTimeout(timeout: number): Promise<void> {}
 
   /**

[Killed] BlockStatement
src/demo-builder.ts:164:32
   /**
    * Close the page
    */
-  async close(): Promise<void> {
-    await this.originalPage.close();
-  }
+  async close(): Promise<void> {}
 
   /**
killedBy: NarratedDemo SoundEnabledPage should delegate close to original page
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] StringLiteral
src/demo-builder.ts:200:23
    */
   get page(): Page | SoundEnabledPage {
     if (!this.state.page) {
-      throw new Error('Demo not started. Call start() first.');
+      throw new Error("");
     }
     if (this.config.sounds && this.soundEnabledPage) {
killedBy: NarratedDemo page getter should throw error before start() is called
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Demo not started. Call start() first."
Received message:   ""

      352 |         } else {
      353 |           stryCov_9fa48("117");
    > 354 |           throw new Error(stryMutAct_9fa48("118") ? "" : (stryCov_9fa48("118"), 'Demo not started. Call start() first.'));

[Killed] BlockStatement
src/demo-builder.ts:202:54
     if (!this.state.page) {
       throw new Error('Demo not started. Call start() first.');
     }
-    if (this.config.sounds && this.soundEnabledPage) {
-      return this.soundEnabledPage;
-    }
+    if (this.config.sounds && this.soundEnabledPage) {}
     return this.state.page;
   }
killedBy: NarratedDemo sounds feature should return SoundEnabledPage when sounds enabled
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: SoundEnabledPage
Received constructor: Object

[Killed] BooleanLiteral
src/demo-builder.ts:215:16
     } as Required<DemoConfig>;
 
     this.state = {
-      started: false,
+      started: true,
       startTime: 0,
       syncTime: 0,
killedBy: NarratedDemo constructor should merge config with defaults
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1770161402591

[Killed] StringLiteral
src/demo-builder.ts:226:54
     };
 
     // Use output directory for temp files
-    this.tempDir = join(dirname(this.config.output), '.demo-temp');
+    this.tempDir = join(dirname(this.config.output), "");
   }
 
killedBy: NarratedDemo constructor should set temp directory based on output path
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/my/custom/path/.demo-temp", {"recursive": true}
Received
       1
          "/my/custom/path",
          {"recursive": true},
       2

[Killed] BlockStatement
src/demo-builder.ts:233:55
    * Record a timestamp for a sound event (used for click sounds)
    * Uses syncTime for audio alignment - this is when the sync marker was shown
    */
-  private recordSoundTimestamp(type: SoundType): void {
-    const timeMs = Date.now() - this.state.syncTime;
-    this.pendingSoundTimestamps.push({ type, timeMs });
-  }
+  private recordSoundTimestamp(type: SoundType): void {}
 
   /**
killedBy: NarratedDemo sounds feature should record click timestamps through SoundEnabledPage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "click"

Number of calls: 0

[Survived] ArithmeticOperator
src/demo-builder.ts:234:20
    * Uses syncTime for audio alignment - this is when the sync marker was shown
    */
   private recordSoundTimestamp(type: SoundType): void {
-    const timeMs = Date.now() - this.state.syncTime;
+    const timeMs = Date.now() + this.state.syncTime;
     this.pendingSoundTimestamps.push({ type, timeMs });
   }

[Killed] BlockStatement
src/demo-builder.ts:242:29
    * Start the demo recording
    */
   async start(): Promise<void> {
-    if (this.state.started) {
-      throw new Error('Demo already started');
-    }
+    if (this.state.started) {}
 
     // Create temp directory
killedBy: NarratedDemo start() should throw error if called twice
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/demo-builder.ts:242:9
    * Start the demo recording
    */
   async start(): Promise<void> {
-    if (this.state.started) {
+    if (false) {
       throw new Error('Demo already started');
     }
killedBy: NarratedDemo start() should throw error if called twice
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] StringLiteral
src/demo-builder.ts:243:23
    */
   async start(): Promise<void> {
     if (this.state.started) {
-      throw new Error('Demo already started');
+      throw new Error("");
     }
 
killedBy: NarratedDemo start() should throw error if called twice
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Demo already started"
Received message:   ""

      421 |         } else {
      422 |           stryCov_9fa48("134");
    > 423 |           throw new Error(stryMutAct_9fa48("135") ? "" : (stryCov_9fa48("135"), 'Demo already started'));

[Killed] BooleanLiteral
src/demo-builder.ts:247:44
     }
 
     // Create temp directory
-    await mkdir(this.tempDir, { recursive: true });
+    await mkdir(this.tempDir, { recursive: false });
 
     // Initialize sounds directory if sounds are enabled
killedBy: NarratedDemo constructor should set temp directory based on output path
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/my/custom/path/.demo-temp", {"recursive": true}
Received
       1
          "/my/custom/path/.demo-temp",
          Object {
        -   "recursive": true,

[Killed] ConditionalExpression
src/demo-builder.ts:251:9
 
     // Initialize sounds directory if sounds are enabled
     // Use assets/sounds for pre-generated sounds that persist across runs
-    if (this.config.sounds) {
+    if (false) {
       const soundsDir = join(__dirname, '..', 'assets', 'sounds');
       initSoundsDir(soundsDir);
killedBy: NarratedDemo sounds feature should initialize sounds directory when sounds enabled
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "sounds"

Number of calls: 0

[Killed] ConditionalExpression
src/demo-builder.ts:251:9
 
     // Initialize sounds directory if sounds are enabled
     // Use assets/sounds for pre-generated sounds that persist across runs
-    if (this.config.sounds) {
+    if (true) {
       const soundsDir = join(__dirname, '..', 'assets', 'sounds');
       initSoundsDir(soundsDir);
killedBy: NarratedDemo sounds feature should not initialize sounds directory when sounds disabled
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "/home/runner/work/demos-not-memos/demos-not-memos/.stryker-tmp/sandbox-vPZJIz/assets/sounds"

[Killed] StringLiteral
src/demo-builder.ts:252:57
     // Initialize sounds directory if sounds are enabled
     // Use assets/sounds for pre-generated sounds that persist across runs
     if (this.config.sounds) {
-      const soundsDir = join(__dirname, '..', 'assets', 'sounds');
+      const soundsDir = join(__dirname, '..', 'assets', "");
       initSoundsDir(soundsDir);
     }
killedBy: NarratedDemo sounds feature should initialize sounds directory when sounds enabled
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "sounds"
Received: "/home/runner/work/demos-not-memos/demos-not-memos/.stryker-tmp/sandbox-vPZJIz/assets"

Number of calls: 1

[Survived] StringLiteral
src/demo-builder.ts:252:47
     // Initialize sounds directory if sounds are enabled
     // Use assets/sounds for pre-generated sounds that persist across runs
     if (this.config.sounds) {
-      const soundsDir = join(__dirname, '..', 'assets', 'sounds');
+      const soundsDir = join(__dirname, '..', "", 'sounds');
       initSoundsDir(soundsDir);
     }

[Killed] BooleanLiteral
src/demo-builder.ts:258:40
 
     // Launch browser with video recording
     const videoDir = join(this.tempDir, 'video');
-    await mkdir(videoDir, { recursive: true });
+    await mkdir(videoDir, { recursive: false });
 
     this.state.browser = await chromium.launch({ headless: false });
killedBy: NarratedDemo start() should create video directory
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "video", {"recursive": true}
Received
       1
          "/tmp/output/.demo-temp",
          {"recursive": true},
       2

[Killed] BooleanLiteral
src/demo-builder.ts:260:60
     const videoDir = join(this.tempDir, 'video');
     await mkdir(videoDir, { recursive: true });
 
-    this.state.browser = await chromium.launch({ headless: false });
+    this.state.browser = await chromium.launch({ headless: true });
     this.state.context = await this.state.browser.newContext({
       viewport: this.config.viewport,
killedBy: NarratedDemo start() should launch browser with headless false
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "headless": false,
+   "headless": true,

[Killed] ObjectLiteral
src/demo-builder.ts:260:48
     const videoDir = join(this.tempDir, 'video');
     await mkdir(videoDir, { recursive: true });
 
-    this.state.browser = await chromium.launch({ headless: false });
+    this.state.browser = await chromium.launch({});
     this.state.context = await this.state.browser.newContext({
       viewport: this.config.viewport,
killedBy: NarratedDemo start() should launch browser with headless false
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "headless": false,
- }

[Killed] ObjectLiteral
src/demo-builder.ts:261:62
     await mkdir(videoDir, { recursive: true });
 
     this.state.browser = await chromium.launch({ headless: false });
-    this.state.context = await this.state.browser.newContext({
-      viewport: this.config.viewport,
-      recordVideo: {
-        dir: videoDir,
-        size: this.config.viewport,
-      },
-    });
+    this.state.context = await this.state.browser.newContext({});
 
     this.state.page = await this.state.context.newPage();
killedBy: NarratedDemo start() should create browser context with viewport and video recording
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "recordVideo": Object {
-     "dir": StringContaining "video",

[Killed] BlockStatement
src/demo-builder.ts:272:29
     this.state.page = await this.state.context.newPage();
 
     // Create sound-enabled page wrapper if sounds are enabled
-    if (this.config.sounds) {
-      this.soundEnabledPage = new SoundEnabledPage(
-        this.state.page,
-        (type) => this.recordSoundTimestamp(type),
-        this.pendingSoundTimestamps,
-        this.state
-      );
-    }
+    if (this.config.sounds) {}
 
     // Navigate to base URL and wait for it to fully load
killedBy: NarratedDemo sounds feature should return SoundEnabledPage when sounds enabled
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: SoundEnabledPage
Received constructor: Object

[Survived] ConditionalExpression
src/demo-builder.ts:272:9
     this.state.page = await this.state.context.newPage();
 
     // Create sound-enabled page wrapper if sounds are enabled
-    if (this.config.sounds) {
+    if (true) {
       this.soundEnabledPage = new SoundEnabledPage(
         this.state.page,

[Killed] ArrowFunction
src/demo-builder.ts:275:9
     if (this.config.sounds) {
       this.soundEnabledPage = new SoundEnabledPage(
         this.state.page,
-        (type) => this.recordSoundTimestamp(type),
+        () => undefined,
         this.pendingSoundTimestamps,
         this.state
killedBy: NarratedDemo sounds feature should record click timestamps through SoundEnabledPage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "click"

Number of calls: 0

[Killed] BooleanLiteral
src/demo-builder.ts:288:26
     console.log(`[TIMING] Page fully loaded`);
 
     // Set startTime AFTER page navigation completes
-    this.state.started = true;
+    this.state.started = false;
     this.state.startTime = Date.now();
     // eslint-disable-next-line no-console
killedBy: NarratedDemo start() should throw error if called twice
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Survived] StringLiteral
src/demo-builder.ts:291:17
     this.state.started = true;
     this.state.startTime = Date.now();
     // eslint-disable-next-line no-console
-    console.log(`[TIMING] startTime captured: ${this.state.startTime} (after page navigation)`);
+    console.log(``);
 
     // Wait 1 second to ensure video recording has stabilized

[Survived] StringLiteral
src/demo-builder.ts:318:17
     // Capture sync time - all audio events will be relative to this moment
     this.state.syncTime = Date.now();
     // eslint-disable-next-line no-console
-    console.log(`[TIMING] syncTime captured: ${this.state.syncTime} (sync marker visible)`);
+    console.log(``);
 
     // Keep marker visible for ~500ms to ensure it's captured in several frames

[Survived] StringLiteral
src/demo-builder.ts:327:17
     // Remove the sync marker
     await this.state.page.evaluate(`document.getElementById('sync-marker')?.remove()`);
     // eslint-disable-next-line no-console
-    console.log(`[TIMING] Sync marker removed after 500ms`);
+    console.log(``);
   }
 

[Killed] BooleanLiteral
src/demo-builder.ts:337:9
    * Returns a Narration object that can be awaited or used with whileDoing
    */
   async narrate(text: string): Promise<Narration> {
-    if (!this.state.started) {
+    if (this.state.started) {
       throw new Error('Demo not started. Call start() first.');
     }
killedBy: NarratedDemo narrate() should throw error if demo not started
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"generate": [Function mockConstructor], "getAudioSegment": [Function mockConstructor], "getDuration": [Function mockConstructor], "waitUntilComplete": [Function mockConstructor], "whileDoing": [Function mockConstructor]}

[Killed] ConditionalExpression
src/demo-builder.ts:337:9
    * Returns a Narration object that can be awaited or used with whileDoing
    */
   async narrate(text: string): Promise<Narration> {
-    if (!this.state.started) {
+    if (false) {
       throw new Error('Demo not started. Call start() first.');
     }
killedBy: NarratedDemo narrate() should throw error if demo not started
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"generate": [Function mockConstructor], "getAudioSegment": [Function mockConstructor], "getDuration": [Function mockConstructor], "waitUntilComplete": [Function mockConstructor], "whileDoing": [Function mockConstructor]}

[Killed] StringLiteral
src/demo-builder.ts:338:23
    */
   async narrate(text: string): Promise<Narration> {
     if (!this.state.started) {
-      throw new Error('Demo not started. Call start() first.');
+      throw new Error("");
     }
 
killedBy: NarratedDemo narrate() should throw error if demo not started
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Demo not started. Call start() first."
Received message:   ""

      534 |         } else {
      535 |           stryCov_9fa48("168");
    > 536 |           throw new Error(stryMutAct_9fa48("169") ? "" : (stryCov_9fa48("169"), 'Demo not started. Call start() first.'));

[Killed] UpdateOperator
src/demo-builder.ts:341:36
       throw new Error('Demo not started. Call start() first.');
     }
 
-    const segmentId = `narration-${++this.narrationCounter}`;
+    const segmentId = `narration-${--this.narrationCounter}`;
     const startTimeMs = Date.now() - this.state.startTime;
 
killedBy: NarratedDemo narrate() should create Narration with correct parameters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Hello world", "Elli", "eleven_v3", Any<Number>, StringContaining ".demo-temp", "narration-1"
Received: "Hello world", "Elli", "eleven_v3", 0, "/tmp/output/.demo-temp", "narration--1"

Number of calls: 1
