[Killed] StringLiteral
src/demo-builder.ts:341:23
       throw new Error('Demo not started. Call start() first.');
     }
 
-    const segmentId = `narration-${++this.narrationCounter}`;
+    const segmentId = ``;
     const startTimeMs = Date.now() - this.state.startTime;
 
killedBy: NarratedDemo narrate() should create Narration with correct parameters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Hello world", "Elli", "eleven_v3", Any<Number>, StringContaining ".demo-temp", "narration-1"
Received: "Hello world", "Elli", "eleven_v3", 0, "/tmp/output/.demo-temp", ""

Number of calls: 1

[Killed] ArithmeticOperator
src/demo-builder.ts:342:25
     }
 
     const segmentId = `narration-${++this.narrationCounter}`;
-    const startTimeMs = Date.now() - this.state.startTime;
+    const startTimeMs = Date.now() + this.state.startTime;
 
     const narration = new Narration(
killedBy: NarratedDemo doWhileNarrating() should pass reasonable startTimeMs to Narration (not absurdly large)
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 10000
Received:   3540322857904

[Killed] ConditionalExpression
src/demo-builder.ts:374:9
    * });
    */
   async narrateAsync(text: string): Promise<Narration> {
-    if (!this.state.started) {
+    if (false) {
       throw new Error('Demo not started. Call start() first.');
     }
killedBy: NarratedDemo narrateAsync() should throw error if demo not started
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"generate": [Function mockConstructor], "getAudioSegment": [Function mockConstructor], "getDuration": [Function mockConstructor], "waitUntilComplete": [Function mockConstructor], "whileDoing": [Function mockConstructor]}

[Killed] BlockStatement
src/demo-builder.ts:374:30
    * });
    */
   async narrateAsync(text: string): Promise<Narration> {
-    if (!this.state.started) {
-      throw new Error('Demo not started. Call start() first.');
-    }
+    if (!this.state.started) {}
 
     const segmentId = `narration-${++this.narrationCounter}`;
killedBy: NarratedDemo narrateAsync() should throw error if demo not started
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"generate": [Function mockConstructor], "getAudioSegment": [Function mockConstructor], "getDuration": [Function mockConstructor], "waitUntilComplete": [Function mockConstructor], "whileDoing": [Function mockConstructor]}

[Killed] BlockStatement
src/demo-builder.ts:408:84
    *   async () => { await demo.page.click('#button'); }
    * );
    */
-  async doWhileNarrating(text: string, action: () => Promise<void>): Promise<void> {
-    const narration = await this.narrateAsync(text);
-    await narration.whileDoing(action);
-  }
+  async doWhileNarrating(text: string, action: () => Promise<void>): Promise<void> {}
 
   /**
killedBy: NarratedDemo doWhileNarrating() should throw error if demo not started
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/demo-builder.ts:416:57
   /**
    * Process pending sound timestamps and add them as audio segments
    */
-  private async processSoundTimestamps(): Promise<void> {
-    if (this.pendingSoundTimestamps.length === 0) {
-      return;
-    }
-
-    // Generate sounds lazily (only generate each type once)
-    const soundTypes = new Set(this.pendingSoundTimestamps.map((s) => s.type));
-    const soundResults = new Map<SoundType, { path: string; durationMs: number }>();
-
-    for (const type of soundTypes) {
-      const result = await generateSound(type);
-      soundResults.set(type, result);
-    }
-
-    // Add audio segments for each timestamp
-    for (const { type, timeMs } of this.pendingSoundTimestamps) {
-      const sound = soundResults.get(type)!;
-      this.state.audioSegments.push({
-        path: sound.path,
-        startTimeMs: timeMs,
-        durationMs: sound.durationMs,
-        type,
-      });
-    }
-  }
+  private async processSoundTimestamps(): Promise<void> {}
 
   /**
killedBy: NarratedDemo sounds feature should record click timestamps through SoundEnabledPage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "click"

Number of calls: 0

[Killed] ConditionalExpression
src/demo-builder.ts:417:9
    * Process pending sound timestamps and add them as audio segments
    */
   private async processSoundTimestamps(): Promise<void> {
-    if (this.pendingSoundTimestamps.length === 0) {
+    if (true) {
       return;
     }
killedBy: NarratedDemo sounds feature should record click timestamps through SoundEnabledPage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "click"

Number of calls: 0

[Killed] EqualityOperator
src/demo-builder.ts:417:9
    * Process pending sound timestamps and add them as audio segments
    */
   private async processSoundTimestamps(): Promise<void> {
-    if (this.pendingSoundTimestamps.length === 0) {
+    if (this.pendingSoundTimestamps.length !== 0) {
       return;
     }
killedBy: NarratedDemo sounds feature should record click timestamps through SoundEnabledPage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "click"

Number of calls: 0

[Killed] BlockStatement
src/demo-builder.ts:425:36
     const soundTypes = new Set(this.pendingSoundTimestamps.map((s) => s.type));
     const soundResults = new Map<SoundType, { path: string; durationMs: number }>();
 
-    for (const type of soundTypes) {
-      const result = await generateSound(type);
-      soundResults.set(type, result);
-    }
+    for (const type of soundTypes) {}
 
     // Add audio segments for each timestamp
killedBy: NarratedDemo sounds feature should record click timestamps through SoundEnabledPage
statusReason: TypeError: Cannot read properties of undefined (reading 'path')

[Killed] BlockStatement
src/demo-builder.ts:431:65
     }
 
     // Add audio segments for each timestamp
-    for (const { type, timeMs } of this.pendingSoundTimestamps) {
-      const sound = soundResults.get(type)!;
-      this.state.audioSegments.push({
-        path: sound.path,
-        startTimeMs: timeMs,
-        durationMs: sound.durationMs,
-        type,
-      });
-    }
+    for (const { type, timeMs } of this.pendingSoundTimestamps) {}
   }
 
killedBy: NarratedDemo sounds feature should record click timestamps through SoundEnabledPage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ArrayContaining [ObjectContaining {"type": "click"}], Any<String>, Any<Number>

Number of calls: 0

[Killed] BooleanLiteral
src/demo-builder.ts:447:9
    * Uses sync marker detection for precise audio/video alignment
    */
   async finish(): Promise<string> {
-    if (!this.state.started) {
+    if (this.state.started) {
       throw new Error('Demo not started. Call start() first.');
     }
killedBy: NarratedDemo doWhileNarrating() should add audio segment to state
statusReason: Error: Demo not started. Call start() first.

[Killed] ConditionalExpression
src/demo-builder.ts:447:9
    * Uses sync marker detection for precise audio/video alignment
    */
   async finish(): Promise<string> {
-    if (!this.state.started) {
+    if (false) {
       throw new Error('Demo not started. Call start() first.');
     }
killedBy: NarratedDemo finish() should throw error if demo not started
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: "/tmp/output/demo.mp4"

[Killed] ConditionalExpression
src/demo-builder.ts:452:9
     }
 
     // Process any pending sound timestamps
-    if (this.config.sounds) {
+    if (false) {
       await this.processSoundTimestamps();
     }
killedBy: NarratedDemo sounds feature should record click timestamps through SoundEnabledPage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "click"

Number of calls: 0

[Killed] BlockStatement
src/demo-builder.ts:452:29
     }
 
     // Process any pending sound timestamps
-    if (this.config.sounds) {
-      await this.processSoundTimestamps();
-    }
+    if (this.config.sounds) {}
 
     // Close the page to finalize video recording
killedBy: NarratedDemo sounds feature should record click timestamps through SoundEnabledPage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "click"

Number of calls: 0

[Killed] BlockStatement
src/demo-builder.ts:457:26
     }
 
     // Close the page to finalize video recording
-    if (this.state.page) {
-      await this.state.page.close();
-      // Get the video path
-      const video = this.state.page.video();
-      if (video) {
-        this.state.videoPath = await video.path();
-      }
-    }
+    if (this.state.page) {}
 
     // Close browser
killedBy: NarratedDemo finish() should close the page
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/demo-builder.ts:461:18
       await this.state.page.close();
       // Get the video path
       const video = this.state.page.video();
-      if (video) {
-        this.state.videoPath = await video.path();
-      }
+      if (video) {}
     }
 
killedBy: NarratedDemo finish() should merge audio and video when both present
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/tmp/video/recorded.webm", StringContaining "combined-audio.wav", "/tmp/output/demo.mp4"

Number of calls: 0

[Killed] BlockStatement
src/demo-builder.ts:467:29
     }
 
     // Close browser
-    if (this.state.context) {
-      await this.state.context.close();
-    }
+    if (this.state.context) {}
     if (this.state.browser) {
       await this.state.browser.close();
killedBy: NarratedDemo finish() should close browser context
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/demo-builder.ts:470:29
     if (this.state.context) {
       await this.state.context.close();
     }
-    if (this.state.browser) {
-      await this.state.browser.close();
-    }
+    if (this.state.browser) {}
 
     // Detect sync marker in video and trim it
killedBy: NarratedDemo finish() should close browser
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/demo-builder.ts:484:32
       console.log(`\n[SYNC] Detecting sync marker in video...`);
       const { firstSyncFrame, lastSyncFrame, frameDurationMs } = await detectSyncFrameRange(this.state.videoPath);
 
-      if (firstSyncFrame >= 0) {
-        // Calculate where the sync marker appears in the video
-        syncFrameOffsetMs = firstSyncFrame * frameDurationMs;
-        const syncDurationFrames = lastSyncFrame - firstSyncFrame + 1;
-        // eslint-disable-next-line no-console
-        console.log(`[SYNC] Sync marker found: frames ${firstSyncFrame}-${lastSyncFrame} (${syncDurationFrames} frames)`);
-        // eslint-disable-next-line no-console
-        console.log(`[SYNC] Sync frame offset: ${syncFrameOffsetMs.toFixed(2)}ms`);
-
-        // Trim sync frames from video
-        // Trim up to and including the last sync frame
-        const framesToTrim = lastSyncFrame + 1;
-        trimDurationMs = framesToTrim * frameDurationMs;
-        const trimmedVideoPath = join(this.tempDir, 'trimmed-video.mp4');
-        await trimSyncFrames(this.state.videoPath, trimmedVideoPath, framesToTrim, frameDurationMs);
-        processedVideoPath = trimmedVideoPath;
-        // eslint-disable-next-line no-console
-        console.log(`[SYNC] Trimmed ${framesToTrim} frames (${trimDurationMs.toFixed(2)}ms) from video`);
-      } else {
+      if (firstSyncFrame >= 0) {} else {
         // eslint-disable-next-line no-console
         console.log(`[SYNC] No sync marker detected in video - using original`);
killedBy: NarratedDemo finish() should detect and trim sync frames when sync marker is found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/tmp/video/recorded.webm", StringContaining "trimmed-video.mp4", 16, 40

Number of calls: 0

[Killed] ConditionalExpression
src/demo-builder.ts:484:11
       console.log(`\n[SYNC] Detecting sync marker in video...`);
       const { firstSyncFrame, lastSyncFrame, frameDurationMs } = await detectSyncFrameRange(this.state.videoPath);
 
-      if (firstSyncFrame >= 0) {
+      if (true) {
         // Calculate where the sync marker appears in the video
         syncFrameOffsetMs = firstSyncFrame * frameDurationMs;
killedBy: NarratedDemo finish() should merge audio and video when both present
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/tmp/video/recorded.webm", StringContaining "combined-audio.wav", "/tmp/output/demo.mp4"
Received: "/tmp/output/.demo-temp/trimmed-video.mp4", "/tmp/output/.demo-temp/combined-audio.wav", "/tmp/output/demo.mp4"

Number of calls: 1

[Killed] ArithmeticOperator
src/demo-builder.ts:486:29
 
       if (firstSyncFrame >= 0) {
         // Calculate where the sync marker appears in the video
-        syncFrameOffsetMs = firstSyncFrame * frameDurationMs;
+        syncFrameOffsetMs = firstSyncFrame / frameDurationMs;
         const syncDurationFrames = lastSyncFrame - firstSyncFrame + 1;
         // eslint-disable-next-line no-console
killedBy: NarratedDemo finish() should pass correct audio offset when sync marker is found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<Array>, Any<String>, 320
Received: [{"durationMs": 2000, "path": "/tmp/output/.demo-temp/narration-1.mp3", "startTimeMs": 0, "type": "narration"}], "/tmp/output/.demo-temp/combined-audio.wav", 479.9

Number of calls: 1

[Survived] ArithmeticOperator
src/demo-builder.ts:487:36
       if (firstSyncFrame >= 0) {
         // Calculate where the sync marker appears in the video
         syncFrameOffsetMs = firstSyncFrame * frameDurationMs;
-        const syncDurationFrames = lastSyncFrame - firstSyncFrame + 1;
+        const syncDurationFrames = lastSyncFrame + firstSyncFrame + 1;
         // eslint-disable-next-line no-console
         console.log(`[SYNC] Sync marker found: frames ${firstSyncFrame}-${lastSyncFrame} (${syncDurationFrames} frames)`);

[Survived] ArithmeticOperator
src/demo-builder.ts:487:36
       if (firstSyncFrame >= 0) {
         // Calculate where the sync marker appears in the video
         syncFrameOffsetMs = firstSyncFrame * frameDurationMs;
-        const syncDurationFrames = lastSyncFrame - firstSyncFrame + 1;
+        const syncDurationFrames = lastSyncFrame - firstSyncFrame - 1;
         // eslint-disable-next-line no-console
         console.log(`[SYNC] Sync marker found: frames ${firstSyncFrame}-${lastSyncFrame} (${syncDurationFrames} frames)`);

[Killed] ArithmeticOperator
src/demo-builder.ts:495:30
 
         // Trim sync frames from video
         // Trim up to and including the last sync frame
-        const framesToTrim = lastSyncFrame + 1;
+        const framesToTrim = lastSyncFrame - 1;
         trimDurationMs = framesToTrim * frameDurationMs;
         const trimmedVideoPath = join(this.tempDir, 'trimmed-video.mp4');
killedBy: NarratedDemo finish() should detect and trim sync frames when sync marker is found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/tmp/video/recorded.webm", StringContaining "trimmed-video.mp4", 16, 40
Received: "/tmp/video/recorded.webm", "/tmp/output/.demo-temp/trimmed-video.mp4", 14, 40

Number of calls: 1

[Killed] ArithmeticOperator
src/demo-builder.ts:496:26
         // Trim sync frames from video
         // Trim up to and including the last sync frame
         const framesToTrim = lastSyncFrame + 1;
-        trimDurationMs = framesToTrim * frameDurationMs;
+        trimDurationMs = framesToTrim / frameDurationMs;
         const trimmedVideoPath = join(this.tempDir, 'trimmed-video.mp4');
         await trimSyncFrames(this.state.videoPath, trimmedVideoPath, framesToTrim, frameDurationMs);
killedBy: NarratedDemo finish() should pass correct audio offset when sync marker is found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<Array>, Any<String>, 320
Received: [{"durationMs": 2000, "path": "/tmp/output/.demo-temp/narration-1.mp3", "startTimeMs": 0, "type": "narration"}], "/tmp/output/.demo-temp/combined-audio.wav", -159.7

Number of calls: 1

[Survived] StringLiteral
src/demo-builder.ts:501:21
         await trimSyncFrames(this.state.videoPath, trimmedVideoPath, framesToTrim, frameDurationMs);
         processedVideoPath = trimmedVideoPath;
         // eslint-disable-next-line no-console
-        console.log(`[SYNC] Trimmed ${framesToTrim} frames (${trimDurationMs.toFixed(2)}ms) from video`);
+        console.log(``);
       } else {
         // eslint-disable-next-line no-console

[Survived] BlockStatement
src/demo-builder.ts:502:14
         processedVideoPath = trimmedVideoPath;
         // eslint-disable-next-line no-console
         console.log(`[SYNC] Trimmed ${framesToTrim} frames (${trimDurationMs.toFixed(2)}ms) from video`);
-      } else {
-        // eslint-disable-next-line no-console
-        console.log(`[SYNC] No sync marker detected in video - using original`);
-      }
+      } else {}
     }
 

[Killed] EqualityOperator
src/demo-builder.ts:510:9
 
     // If we have audio segments, concatenate them with sync-based offset
     let audioPath: string | null = null;
-    if (this.state.audioSegments.length > 0) {
+    if (this.state.audioSegments.length >= 0) {
       // Calculate the audio offset based on video trimming
       // Audio timestamps are relative to syncTime (when sync marker first appeared in video)
killedBy: NarratedDemo finish() should not concatenate audio when no segments
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: [], "/tmp/output/.demo-temp/combined-audio.wav", 0

[Killed] EqualityOperator
src/demo-builder.ts:510:9
 
     // If we have audio segments, concatenate them with sync-based offset
     let audioPath: string | null = null;
-    if (this.state.audioSegments.length > 0) {
+    if (this.state.audioSegments.length <= 0) {
       // Calculate the audio offset based on video trimming
       // Audio timestamps are relative to syncTime (when sync marker first appeared in video)
killedBy: NarratedDemo doWhileNarrating() should add audio segment to state
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ArrayContaining [ObjectContaining {"type": "narration"}], Any<String>, Any<Number>

Number of calls: 0

[Killed] ArithmeticOperator
src/demo-builder.ts:534:27
       // - trimDurationMs = 480ms (trimmed frames 0-11)
       // - Audio at 1000ms should play at 1000 - (480 - 160) = 680ms in trimmed video
 
-      const audioOffset = trimDurationMs - syncFrameOffsetMs;
+      const audioOffset = trimDurationMs + syncFrameOffsetMs;
 
       // eslint-disable-next-line no-console
killedBy: NarratedDemo finish() should pass correct audio offset when sync marker is found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<Array>, Any<String>, 320
Received: [{"durationMs": 2000, "path": "/tmp/output/.demo-temp/narration-1.mp3", "startTimeMs": 0, "type": "narration"}], "/tmp/output/.demo-temp/combined-audio.wav", 640

Number of calls: 1

[Survived] StringLiteral
src/demo-builder.ts:537:19
       const audioOffset = trimDurationMs - syncFrameOffsetMs;
 
       // eslint-disable-next-line no-console
-      console.log(`\n[TIMING] Final audio segments (${this.state.audioSegments.length} total):`);
+      console.log(``);
       // eslint-disable-next-line no-console
       console.log(`[TIMING] syncFrameOffsetMs: ${syncFrameOffsetMs.toFixed(2)}ms (when marker first appeared)`);

[Survived] StringLiteral
src/demo-builder.ts:539:19
       // eslint-disable-next-line no-console
       console.log(`\n[TIMING] Final audio segments (${this.state.audioSegments.length} total):`);
       // eslint-disable-next-line no-console
-      console.log(`[TIMING] syncFrameOffsetMs: ${syncFrameOffsetMs.toFixed(2)}ms (when marker first appeared)`);
+      console.log(``);
       // eslint-disable-next-line no-console
       console.log(`[TIMING] trimDurationMs: ${trimDurationMs.toFixed(2)}ms (total video trimmed)`);

[Survived] BlockStatement
src/demo-builder.ts:544:51
       console.log(`[TIMING] trimDurationMs: ${trimDurationMs.toFixed(2)}ms (total video trimmed)`);
       // eslint-disable-next-line no-console
       console.log(`[TIMING] audioOffset: ${audioOffset.toFixed(2)}ms (trim - sync offset)`);
-      for (const seg of this.state.audioSegments) {
-        // eslint-disable-next-line no-console
-        console.log(`  ${seg.type} at ${seg.startTimeMs}ms -> ${seg.startTimeMs - audioOffset}ms (duration: ${seg.durationMs}ms)`);
-      }
+      for (const seg of this.state.audioSegments) {}
 
       audioPath = join(this.tempDir, 'combined-audio.wav');

[Survived] ArithmeticOperator
src/demo-builder.ts:546:65
       console.log(`[TIMING] audioOffset: ${audioOffset.toFixed(2)}ms (trim - sync offset)`);
       for (const seg of this.state.audioSegments) {
         // eslint-disable-next-line no-console
-        console.log(`  ${seg.type} at ${seg.startTimeMs}ms -> ${seg.startTimeMs - audioOffset}ms (duration: ${seg.durationMs}ms)`);
+        console.log(`  ${seg.type} at ${seg.startTimeMs}ms -> ${seg.startTimeMs + audioOffset}ms (duration: ${seg.durationMs}ms)`);
       }
 

[Killed] BooleanLiteral
src/demo-builder.ts:554:59
     }
 
     // Create output directory
-    await mkdir(dirname(this.config.output), { recursive: true });
+    await mkdir(dirname(this.config.output), { recursive: false });
 
     // Merge audio and video if we have both
killedBy: NarratedDemo finish() should create output directory
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/tmp/output", {"recursive": true}
Received
       1
          "/tmp/output/.demo-temp",
          {"recursive": true},
       2

[Killed] BlockStatement
src/demo-builder.ts:557:60
     await mkdir(dirname(this.config.output), { recursive: true });
 
     // Merge audio and video if we have both
-    if (processedVideoPath !== null && audioPath !== null) {
-      await mergeAudioVideo(processedVideoPath, audioPath, this.config.output);
-    } else if (processedVideoPath !== null) {
+    if (processedVideoPath !== null && audioPath !== null) {} else if (processedVideoPath !== null) {
       // Just copy video if no audio
       const { exec } = await import('child_process');
killedBy: NarratedDemo finish() should merge audio and video when both present
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/tmp/video/recorded.webm", StringContaining "combined-audio.wav", "/tmp/output/demo.mp4"

Number of calls: 0

[Killed] BlockStatement
src/demo-builder.ts:559:45
     // Merge audio and video if we have both
     if (processedVideoPath !== null && audioPath !== null) {
       await mergeAudioVideo(processedVideoPath, audioPath, this.config.output);
-    } else if (processedVideoPath !== null) {
-      // Just copy video if no audio
-      const { exec } = await import('child_process');
-      const { promisify } = await import('util');
-      const execAsync = promisify(exec);
-      await execAsync(`cp "${processedVideoPath}" "${this.config.output}"`);
-    }
+    } else if (processedVideoPath !== null) {}
 
     return this.config.output;
killedBy: NarratedDemo finish() should execute cp command to copy video when no audio segments
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "cp"

Number of calls: 0

[Killed] EqualityOperator
src/demo-builder.ts:559:16
     // Merge audio and video if we have both
     if (processedVideoPath !== null && audioPath !== null) {
       await mergeAudioVideo(processedVideoPath, audioPath, this.config.output);
-    } else if (processedVideoPath !== null) {
+    } else if (processedVideoPath === null) {
       // Just copy video if no audio
       const { exec } = await import('child_process');
killedBy: NarratedDemo finish() should execute cp command to copy video when no audio segments
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "cp"

Number of calls: 0

[Killed] ConditionalExpression
src/demo-builder.ts:574:9
    * Get elapsed time since demo started in milliseconds
    */
   getElapsedTime(): number {
-    if (!this.state.started) {
+    if (true) {
       return 0;
     }
killedBy: NarratedDemo getElapsedTime() should return elapsed time after start
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] BlockStatement
src/demo-builder.ts:574:30
    * Get elapsed time since demo started in milliseconds
    */
   getElapsedTime(): number {
-    if (!this.state.started) {
-      return 0;
-    }
+    if (!this.state.started) {}
     return Date.now() - this.state.startTime;
   }
killedBy: NarratedDemo constructor should merge config with defaults
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1770161483065

[Killed] ArithmeticOperator
src/demo-builder.ts:577:12
     if (!this.state.started) {
       return 0;
     }
-    return Date.now() - this.state.startTime;
+    return Date.now() + this.state.startTime;
   }
 }
killedBy: NarratedDemo getElapsedTime() should return reasonable elapsed time (not absurdly large)
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 10000
Received:   3540322967346
