[Killed] BlockStatement
src/narration.ts:38:35
    * Generate TTS and start the timer
    * Called internally by NarratedDemo
    */
-  async generate(): Promise<void> {
-    const audioPath = `${this.outputDir}/${this.segmentId}.mp3`;
-
-    this.ttsResult = await generateTTS({
-      text: this.text,
-      voice: this.voice,
-      model: this.model,
-      outputPath: audioPath,
-    });
-
-    // Set up completion promise with timer
-    this.completionPromise = new Promise((resolve) => {
-      this.resolveCompletion = resolve;
-      setTimeout(resolve, this.ttsResult!.durationMs);
-    });
-  }
+  async generate(): Promise<void> {}
 
   /**
killedBy: Narration generate should call generateTTS with correct parameters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"model": "eleven_v2", "outputPath": "/custom/path/seg-42.mp3", "text": "Test narration", "voice": "Josh"}

Number of calls: 0

[Timeout] BlockStatement
src/narration.ts:49:55
     });
 
     // Set up completion promise with timer
-    this.completionPromise = new Promise((resolve) => {
-      this.resolveCompletion = resolve;
-      setTimeout(resolve, this.ttsResult!.durationMs);
-    });
+    this.completionPromise = new Promise((resolve) => {});
   }
 

[Killed] BlockStatement
src/narration.ts:58:44
   /**
    * Wait for the narration to complete (speech duration)
    */
-  async waitUntilComplete(): Promise<void> {
-    if (!this.completionPromise) {
-      throw new Error('Narration not yet generated');
-    }
-    await this.completionPromise;
-  }
+  async waitUntilComplete(): Promise<void> {}
 
   /**
killedBy: Narration waitUntilComplete should throw error if called before generate
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/narration.ts:59:9
    * Wait for the narration to complete (speech duration)
    */
   async waitUntilComplete(): Promise<void> {
-    if (!this.completionPromise) {
+    if (false) {
       throw new Error('Narration not yet generated');
     }
killedBy: Narration waitUntilComplete should throw error if called before generate
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BooleanLiteral
src/narration.ts:59:9
    * Wait for the narration to complete (speech duration)
    */
   async waitUntilComplete(): Promise<void> {
-    if (!this.completionPromise) {
+    if (this.completionPromise) {
       throw new Error('Narration not yet generated');
     }
killedBy: Narration generate should set up completion promise with timer
statusReason: Error: Narration not yet generated

[Killed] StringLiteral
src/narration.ts:60:23
    */
   async waitUntilComplete(): Promise<void> {
     if (!this.completionPromise) {
-      throw new Error('Narration not yet generated');
+      throw new Error("");
     }
     await this.completionPromise;
killedBy: Narration waitUntilComplete should throw error if called before generate
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Narration not yet generated"
Received message:   ""

      119 |         } else {
      120 |           stryCov_9fa48("486");
    > 121 |           throw new Error(stryMutAct_9fa48("487") ? "" : (stryCov_9fa48("487"), 'Narration not yet generated'));

[Killed] BlockStatement
src/narration.ts:69:64
    * Execute an action while narrating (in parallel)
    * Returns a promise that resolves when BOTH narration and action complete
    */
-  async whileDoing(action: () => Promise<void>): Promise<void> {
-    if (!this.completionPromise) {
-      throw new Error('Narration not yet generated');
-    }
-    await Promise.all([this.completionPromise, action()]);
-  }
+  async whileDoing(action: () => Promise<void>): Promise<void> {}
 
   /**
killedBy: Narration whileDoing should throw error if called before generate
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/narration.ts:70:9
    * Returns a promise that resolves when BOTH narration and action complete
    */
   async whileDoing(action: () => Promise<void>): Promise<void> {
-    if (!this.completionPromise) {
+    if (true) {
       throw new Error('Narration not yet generated');
     }
killedBy: Narration whileDoing should execute action in parallel with narration
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/narration.ts:70:9
    * Returns a promise that resolves when BOTH narration and action complete
    */
   async whileDoing(action: () => Promise<void>): Promise<void> {
-    if (!this.completionPromise) {
+    if (this.completionPromise) {
       throw new Error('Narration not yet generated');
     }
killedBy: Narration whileDoing should throw error if called before generate
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ArrayDeclaration
src/narration.ts:73:23
     if (!this.completionPromise) {
       throw new Error('Narration not yet generated');
     }
-    await Promise.all([this.completionPromise, action()]);
+    await Promise.all([]);
   }
 
killedBy: Narration whileDoing should execute action in parallel with narration
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
src/narration.ts:81:23
    */
   getDuration(): number {
     if (!this.ttsResult) {
-      throw new Error('Narration not yet generated');
+      throw new Error("");
     }
     return this.ttsResult.durationMs;
killedBy: Narration getDuration should throw error if called before generate
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Narration not yet generated"
Received message:   ""

      160 |         } else {
      161 |           stryCov_9fa48("499");
    > 162 |           throw new Error(stryMutAct_9fa48("500") ? "" : (stryCov_9fa48("500"), 'Narration not yet generated'));
