[Killed] LogicalOperator
src/sounds.ts:67:20
  * Ensures we don't play the same variant twice in a row
  */
 export function getVariantSoundType(baseType: 'keypress-letter' | 'keypress-space'): SoundType {
-  const lastUsed = lastVariantUsed.get(baseType) ?? 0;
+  const lastUsed = lastVariantUsed.get(baseType) && 0;
 
   // Pick a random variant that's not the last one used
killedBy: sounds getVariantSoundType should avoid immediate repetition for keypress-letter
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not "keypress-letter-3"

[Killed] ArithmeticOperator
src/sounds.ts:72:15
   // Pick a random variant that's not the last one used
   let variant: number;
   do {
-    variant = Math.floor(Math.random() * 5) + 1;
+    variant = Math.floor(Math.random() * 5) - 1;
   } while (variant === lastUsed);
 
killedBy: sounds getVariantSoundType should return a valid keypress-space variant
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /^keypress-space-[1-5]$/
Received string:  "keypress-space--1"

[Timeout] ArithmeticOperator
src/sounds.ts:72:26
   // Pick a random variant that's not the last one used
   let variant: number;
   do {
-    variant = Math.floor(Math.random() * 5) + 1;
+    variant = Math.floor(Math.random() / 5) + 1;
   } while (variant === lastUsed);
 

[Killed] ConditionalExpression
src/sounds.ts:73:12
   let variant: number;
   do {
     variant = Math.floor(Math.random() * 5) + 1;
-  } while (variant === lastUsed);
+  } while (false);
 
   lastVariantUsed.set(baseType, variant);
killedBy: sounds getVariantSoundType should avoid immediate repetition for keypress-letter
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not "keypress-letter-2"

[Timeout] EqualityOperator
src/sounds.ts:73:12
   let variant: number;
   do {
     variant = Math.floor(Math.random() * 5) + 1;
-  } while (variant === lastUsed);
+  } while (variant !== lastUsed);
 
   lastVariantUsed.set(baseType, variant);

[Killed] BlockStatement
src/sounds.ts:102:50
  * Initialize the sounds directory for caching
  * Call this before generating any sounds
  */
-export function initSoundsDir(dir: string): void {
-  soundsDir = dir;
-  if (!existsSync(dir)) {
-    mkdirSync(dir, { recursive: true });
-  }
-}
+export function initSoundsDir(dir: string): void {}
 
 /**
killedBy: sounds initSoundsDir should create directory if it does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/path/to/sounds", {"recursive": true}

Number of calls: 0

[Killed] ConditionalExpression
src/sounds.ts:104:7
  */
 export function initSoundsDir(dir: string): void {
   soundsDir = dir;
-  if (!existsSync(dir)) {
+  if (true) {
     mkdirSync(dir, { recursive: true });
   }
killedBy: sounds initSoundsDir should not create directory if it already exists
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "/path/to/sounds", {"recursive": true}

[Killed] BlockStatement
src/sounds.ts:104:25
  */
 export function initSoundsDir(dir: string): void {
   soundsDir = dir;
-  if (!existsSync(dir)) {
-    mkdirSync(dir, { recursive: true });
-  }
+  if (!existsSync(dir)) {}
 }
 
killedBy: sounds initSoundsDir should create directory if it does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/path/to/sounds", {"recursive": true}

Number of calls: 0

[Killed] EqualityOperator
src/sounds.ts:115:12
 function isValidSoundFile(filePath: string): boolean {
   try {
     const stats = statSync(filePath);
-    return stats.size >= MIN_VALID_FILE_SIZE;
+    return stats.size < MIN_VALID_FILE_SIZE;
   } catch {
     return false;
killedBy: sounds generateSound should generate click sound with correct prompt
statusReason: Error: Failed to generate valid sound for "click" after 3 attempts. ElevenLabs may be generating silent audio for this prompt.

[Killed] ConditionalExpression
src/sounds.ts:115:12
 function isValidSoundFile(filePath: string): boolean {
   try {
     const stats = statSync(filePath);
-    return stats.size >= MIN_VALID_FILE_SIZE;
+    return false;
   } catch {
     return false;
killedBy: sounds generateSound should generate click sound with correct prompt
statusReason: Error: Failed to generate valid sound for "click" after 3 attempts. ElevenLabs may be generating silent audio for this prompt.

[Killed] BlockStatement
src/sounds.ts:128:15
 export async function generateSound(type: SoundType): Promise<SoundResult> {
   // Return cached sound if available
   const cached = soundCache.get(type);
-  if (cached) {
-    return cached;
-  }
+  if (cached) {}
 
   if (soundsDir === null) {
killedBy: sounds generateSound should cache sound result and not regenerate
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Killed] LogicalOperator
src/sounds.ts:140:7
 
   // Check if sound file already exists on disk (from previous runs)
   // Also validate it's not a corrupt file from a previous failed attempt
-  if (existsSync(outputPath) && isValidSoundFile(outputPath)) {
+  if (existsSync(outputPath) || isValidSoundFile(outputPath)) {
     const durationMs = await getAudioDuration(outputPath);
     const result: SoundResult = { path: outputPath, durationMs };
killedBy: sounds generateSound should generate click sound with correct prompt
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"duration_seconds": 0.5, "text": "MacBook Pro trackpad click, soft satisfying tap, ASMR quality, no background noise, isolated sound"}

Number of calls: 0

[Killed] ConditionalExpression
src/sounds.ts:140:7
 
   // Check if sound file already exists on disk (from previous runs)
   // Also validate it's not a corrupt file from a previous failed attempt
-  if (existsSync(outputPath) && isValidSoundFile(outputPath)) {
+  if (false) {
     const durationMs = await getAudioDuration(outputPath);
     const result: SoundResult = { path: outputPath, durationMs };
killedBy: sounds generateSound should load from disk if file exists and is valid
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: {"duration_seconds": 0.5, "text": "MacBook Pro trackpad click, soft satisfying tap, ASMR quality, no background noise, isolated sound"}

[Killed] StringLiteral
src/sounds.ts:149:36
 
   const client = new ElevenLabsClient();
   const prompt = SOUND_PROMPTS[type];
-  const tempPath = join(soundsDir, `${type}.temp.mp3`);
+  const tempPath = join(soundsDir, ``);
 
   // Retry loop - ElevenLabs sometimes generates "duds" (entirely silent audio)
killedBy: sounds generateSound should write audio to temp path before trimming
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/tmp/sounds/click.temp.mp3"
Received: "/tmp/sounds"

Number of calls: 1

[Killed] ConditionalExpression
src/sounds.ts:152:25
   const tempPath = join(soundsDir, `${type}.temp.mp3`);
 
   // Retry loop - ElevenLabs sometimes generates "duds" (entirely silent audio)
-  for (let attempt = 1; attempt <= MAX_GENERATION_RETRIES; attempt++) {
+  for (let attempt = 1; false; attempt++) {
     // ElevenLabs minimum duration is 0.5s, so we generate at minimum
     const audioStream = await client.textToSoundEffects.convert({
killedBy: sounds generateSound should generate click sound with correct prompt
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"duration_seconds": 0.5, "text": "MacBook Pro trackpad click, soft satisfying tap, ASMR quality, no background noise, isolated sound"}

Number of calls: 0

[Killed] EqualityOperator
src/sounds.ts:152:25
   const tempPath = join(soundsDir, `${type}.temp.mp3`);
 
   // Retry loop - ElevenLabs sometimes generates "duds" (entirely silent audio)
-  for (let attempt = 1; attempt <= MAX_GENERATION_RETRIES; attempt++) {
+  for (let attempt = 1; attempt > MAX_GENERATION_RETRIES; attempt++) {
     // ElevenLabs minimum duration is 0.5s, so we generate at minimum
     const audioStream = await client.textToSoundEffects.convert({
killedBy: sounds generateSound should generate click sound with correct prompt
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"duration_seconds": 0.5, "text": "MacBook Pro trackpad click, soft satisfying tap, ASMR quality, no background noise, isolated sound"}

Number of calls: 0

[Survived] ArithmeticOperator
src/sounds.ts:165:26
     // Trim to target duration using ffmpeg (real keypresses are 30-80ms)
     // Use silenceremove to strip leading silence before trimming, since ElevenLabs
     // may generate sounds where the actual audio content starts later in the file
-    const fadeOutStart = TARGET_SOUND_DURATION_SECONDS * 0.7;
+    const fadeOutStart = TARGET_SOUND_DURATION_SECONDS / 0.7;
     const fadeOutDuration = TARGET_SOUND_DURATION_SECONDS * 0.3;
     execSync(

[Survived] ArithmeticOperator
src/sounds.ts:166:29
     // Use silenceremove to strip leading silence before trimming, since ElevenLabs
     // may generate sounds where the actual audio content starts later in the file
     const fadeOutStart = TARGET_SOUND_DURATION_SECONDS * 0.7;
-    const fadeOutDuration = TARGET_SOUND_DURATION_SECONDS * 0.3;
+    const fadeOutDuration = TARGET_SOUND_DURATION_SECONDS / 0.3;
     execSync(
       `ffmpeg -y -i "${tempPath}" -af "silenceremove=start_periods=1:start_threshold=-30dB,afade=t=out:st=${fadeOutStart}:d=${fadeOutDuration}" -t ${TARGET_SOUND_DURATION_SECONDS} "${outputPath}"`,

[Killed] StringLiteral
src/sounds.ts:168:7
     const fadeOutStart = TARGET_SOUND_DURATION_SECONDS * 0.7;
     const fadeOutDuration = TARGET_SOUND_DURATION_SECONDS * 0.3;
     execSync(
-      `ffmpeg -y -i "${tempPath}" -af "silenceremove=start_periods=1:start_threshold=-30dB,afade=t=out:st=${fadeOutStart}:d=${fadeOutDuration}" -t ${TARGET_SOUND_DURATION_SECONDS} "${outputPath}"`,
+      ``,
       { stdio: 'pipe' }
     );
killedBy: sounds generateSound should call ffmpeg with silenceremove filter
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "silenceremove=start_periods=1:start_threshold=-30dB", Any<Object>
Received: "", {"stdio": "pipe"}

Number of calls: 1

[Survived] ObjectLiteral
src/sounds.ts:169:7
     const fadeOutDuration = TARGET_SOUND_DURATION_SECONDS * 0.3;
     execSync(
       `ffmpeg -y -i "${tempPath}" -af "silenceremove=start_periods=1:start_threshold=-30dB,afade=t=out:st=${fadeOutStart}:d=${fadeOutDuration}" -t ${TARGET_SOUND_DURATION_SECONDS} "${outputPath}"`,
-      { stdio: 'pipe' }
+      {}
     );
 

[Killed] BlockStatement
src/sounds.ts:173:31
     );
 
     // Clean up temp file
-    if (existsSync(tempPath)) {
-      unlinkSync(tempPath);
-    }
+    if (existsSync(tempPath)) {}
 
     // Validate the output file
killedBy: sounds generateSound should clean up temp file after trimming
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/tmp/sounds/click.temp.mp3"

Number of calls: 0

[Killed] ConditionalExpression
src/sounds.ts:173:9
     );
 
     // Clean up temp file
-    if (existsSync(tempPath)) {
+    if (false) {
       unlinkSync(tempPath);
     }
killedBy: sounds generateSound should clean up temp file after trimming
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/tmp/sounds/click.temp.mp3"

Number of calls: 0

[Killed] ConditionalExpression
src/sounds.ts:178:9
     }
 
     // Validate the output file
-    if (isValidSoundFile(outputPath)) {
+    if (false) {
       break; // Success!
     }
killedBy: sounds generateSound should generate click sound with correct prompt
statusReason: Error: Failed to generate valid sound for "click" after 3 attempts. ElevenLabs may be generating silent audio for this prompt.

[Killed] ConditionalExpression
src/sounds.ts:178:9
     }
 
     // Validate the output file
-    if (isValidSoundFile(outputPath)) {
+    if (true) {
       break; // Success!
     }
killedBy: sounds generateSound should retry when generated file is too small (silent audio)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 3
Received number of calls: 1

[Survived] ConditionalExpression
src/sounds.ts:183:9
     }
 
     // Delete invalid file before retry
-    if (existsSync(outputPath)) {
+    if (false) {
       unlinkSync(outputPath);
     }

[Survived] ConditionalExpression
src/sounds.ts:183:9
     }
 
     // Delete invalid file before retry
-    if (existsSync(outputPath)) {
+    if (true) {
       unlinkSync(outputPath);
     }

[Killed] BlockStatement
src/sounds.ts:187:45
       unlinkSync(outputPath);
     }
 
-    if (attempt === MAX_GENERATION_RETRIES) {
-      throw new Error(
-        `Failed to generate valid sound for "${type}" after ${MAX_GENERATION_RETRIES} attempts. ` +
-        `ElevenLabs may be generating silent audio for this prompt.`
-      );
-    }
+    if (attempt === MAX_GENERATION_RETRIES) {}
   }
 
killedBy: sounds generateSound should throw error after max retries for invalid files
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"durationMs": 100, "path": "/tmp/sounds/click.mp3"}

[Killed] ConditionalExpression
src/sounds.ts:187:9
       unlinkSync(outputPath);
     }
 
-    if (attempt === MAX_GENERATION_RETRIES) {
+    if (true) {
       throw new Error(
         `Failed to generate valid sound for "${type}" after ${MAX_GENERATION_RETRIES} attempts. ` +
killedBy: sounds generateSound should retry when generated file is too small (silent audio)
statusReason: Error: Failed to generate valid sound for "click" after 3 attempts. ElevenLabs may be generating silent audio for this prompt.

[Killed] StringLiteral
src/sounds.ts:189:9
 
     if (attempt === MAX_GENERATION_RETRIES) {
       throw new Error(
-        `Failed to generate valid sound for "${type}" after ${MAX_GENERATION_RETRIES} attempts. ` +
+        `` +
         `ElevenLabs may be generating silent audio for this prompt.`
       );
killedBy: sounds generateSound should throw error after max retries for invalid files
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Failed to generate valid sound for \"click\" after 3 attempts"
Received message:   "ElevenLabs may be generating silent audio for this prompt."

      303 |           } else {
      304 |             stryCov_9fa48("570");

[Survived] StringLiteral
src/sounds.ts:190:9
     if (attempt === MAX_GENERATION_RETRIES) {
       throw new Error(
         `Failed to generate valid sound for "${type}" after ${MAX_GENERATION_RETRIES} attempts. ` +
-        `ElevenLabs may be generating silent audio for this prompt.`
+        ``
       );
     }

[Killed] BlockStatement
src/sounds.ts:205:41
 /**
  * Clear the sound cache (useful for testing)
  */
-export function clearSoundCache(): void {
-  soundCache.clear();
-  soundsDir = null;
-}
+export function clearSoundCache(): void {}
 
 /**
killedBy: sounds generateSound should throw error if sounds directory not initialized
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"durationMs": 100, "path": "/path/to/sounds/click.mp3"}
